[{"id": "2101.00086", "title": "calculus: High Dimensional Numerical and Symbolic Calculus in R", "abstract": "The R package calculus implements C++ optimized functions for numerical and\nsymbolic calculus, such as the Einstein summing convention, fast computation of\nthe Levi-Civita symbol and generalized Kronecker delta, Taylor series\nexpansion, multivariate Hermite polynomials, high-order derivatives, ordinary\ndifferential equations, differential operators and numerical integration in\narbitrary orthogonal coordinate systems. The library applies numerical methods\nwhen working with R functions or symbolic programming when working with\ncharacters or expressions. The package handles multivariate numerical calculus\nin arbitrary dimensions and coordinates and implements the symbolic counterpart\nof the numerical methods whenever possible, without depending on external\ncomputer algebra systems. Except for Rcpp, the package has no strict\ndependencies in order to provide a stable self-contained toolbox that invites\nre-use."}, {"id": "2101.00099", "title": "Deep learning for low frequency extrapolation of multicomponent data in\n  elastic full waveform inversion", "abstract": "Full waveform inversion (FWI) strongly depends on an accurate starting model\nto succeed. This is particularly true in the elastic regime: The cycle-skipping\nphenomenon is more severe in elastic FWI compared to acoustic FWI, due to the\nshort S-wave wavelength. In this paper, we extend our work on extrapolated FWI\n(EFWI) by proposing to synthesize the low frequencies of multi-component\nelastic seismic records, and use those \"artificial\" low frequencies to seed the\nfrequency sweep of elastic FWI. Our solution involves deep learning: we\nseparately train the same convolutional neural network (CNN) on two training\ndatasets, one with vertical components and one with horizontal components of\nparticle velocities, to extrapolate the low frequencies of elastic data. The\narchitecture of this CNN is designed with a large receptive field, by either\nlarge convolutional kernels or dilated convolution. Numerical examples on the\nMarmousi2 model show that the 2-4Hz low frequency data extrapolated from\nband-limited data above 4Hz provide good starting models for elastic FWI of\nP-wave and S-wave velocities. Additionally, we study the generalization ability\nof the proposed neural network over different physical models. For elastic test\ndata, collecting the training dataset by elastic simulation shows better\nextrapolation accuracy than acoustic simulation, i.e., a smaller generalization\ngap."}, {"id": "2101.00146", "title": "De-identifying Australian Hospital Discharge Summaries: An End-to-End\n  Framework using Ensemble of Deep Learning Models", "abstract": "Electronic Medical Records (EMRs) contain clinical narrative text that is of\ngreat potential value to medical researchers. However, this information is\nmixed with Personally Identifiable Information (PII) that presents risks to\npatient and clinician confidentiality. This paper presents an end-to-end\ndeidentification framework to automatically remove PII from Australian hospital\ndischarge summaries. Our corpus included 600 hospital discharge summaries which\nwere extracted from the EMRs of two principal referral hospitals in Sydney,\nAustralia. Our end-to-end de-identification framework consists of three\ncomponents: 1) Annotation: labelling of PII in the 600 hospital discharge\nsummaries using five pre-defined categories: person, address, date of birth,\nindividual identification number, phone/fax number; 2) Modelling: training six\nnamed entity recognition (NER) deep learning base-models on balanced and\nimbalanced datasets; and evaluating ensembles that combine all six base-models,\nthe three base-models with the best F1 scores and the three base-models with\nthe best recall scores respectively, using token-level majority voting and\nstacking methods; and 3) De-identification: removing PII from the hospital\ndischarge summaries. Our results showed that the ensemble model combined using\nthe stacking Support Vector Machine (SVM) method on the three base-models with\nthe best F1 scores achieved excellent results with a F1 score of 99.16% on the\ntest set of our corpus. We also evaluated the robustness of our modelling\ncomponent on the 2014 i2b2 de-identification dataset. Our ensemble model, which\nuses the token-level majority voting method on all six basemodels, achieved the\nhighest F1 score of 96.24% at strict entity matching and the highest F1 score\nof 98.64% at binary token-level matching compared to two state-of-the-art\nmethods."}, {"id": "2101.00522", "title": "Domain Adaptation for the Segmentation of Confidential Medical Images", "abstract": "Convolutional neural networks (CNNs) have led to significant improvements in\nthe semantic segmentation of images. When source and target datasets come from\ndifferent modalities, CNN performance suffers due to domain shift. In such\ncases data annotation in the target domain becomes necessary to maintain model\nperformance. To circumvent the re-annotation process, unsupervised domain\nadaptation (UDA) is proposed to adapt a model to new modalities using solely\nunlabeled target data. Common UDA algorithms require access to source domain\ndata during adaptation, which may not be feasible in medical imaging due to\ndata sharing restrictions. In this work, we develop an algorithm for UDA where\nthe source domain data is inaccessible during target adaptation. Our approach\nis based on encoding the source domain information into an internal\ndistribution that is used to guide adaptation in the absence of source samples.\nWe demonstrate the effectiveness of our algorithm by comparing it to\nstate-of-the-art medical image semantic segmentation approaches on two medical\nimage semantic segmentation datasets."}, {"id": "2101.00647", "title": "In-Ear SpO2 for Classification of Cognitive Workload", "abstract": "Classification of cognitive workload promises immense benefit in diverse\nareas ranging from driver safety to augmenting human capability through closed\nloop brain computer interface. The brain is the most metabolically active organ\nin the body and increases its metabolic activity and thus oxygen consumption\nwith increasing cognitive demand. In this study, we explore the feasibility of\nin-ear SpO2 cognitive workload tracking. To this end, we preform cognitive\nworkload assessment in 8 subjects, based on an N-back task, whereby the\nsubjects are asked to count and remember the number of odd numbers displayed on\na screen in 5 second windows. The 2 and 3-back tasks lead to either the lowest\nmedian absolute SpO2 or largest median decrease in SpO2 in all of the subjects,\nindicating a robust and measurable decrease in blood oxygen in response to\nincreased cognitive workload. Using features derived from in-ear pulse\noximetry, including SpO2, pulse rate and respiration rate, we were able to\nclassify the 4 N-back task categories, over 5 second epochs, with a mean\naccuracy of 94.2%. Moreover, out of 21 total features, the 9 most important\nfeatures for classification accuracy were all SpO2 related features. The\nfindings suggest that in-ear SpO2 measurements provide valuable information for\nclassification of cognitive workload over short time windows, which together\nwith the small form factor promises a new avenue for real time cognitive\nworkload tracking."}, {"id": "2101.00694", "title": "Solving Cut-Problems in Quadratic Time for Graphs With Bounded Treewidth", "abstract": "In the problem (Unweighted) Max-Cut we are given a graph $G = (V,E)$ and\nasked for a set $S \\subseteq V$ such that the number of edges from $S$ to $V\n\\setminus S$ is maximal. In this paper we consider an even harder problem:\n(Weighted) Max-Bisection. Here we are given an undirected graph $G = (V,E)$ and\na weight function $w \\colon E \\to \\mathbb Q_{>0}$ and the task is to find a set\n$S \\subseteq V$ such that (i) the sum of the weights of edges from $S$ is\nmaximal; and (ii) $S$ contains $\\left\\lceil{\\frac{n}{2}}\\right\\rceil$ vertices\n(where $n = \\lvert V\\rvert$). We design a framework that allows to solve this\nproblem in time $\\mathcal O(2^t n^2)$ if a tree decomposition of width $t$ is\ngiven as part of the input. This improves the previously best running time for\nMax-Bisection of [DBLP:journals/tcs/HanakaKS21] by a factor $t^2$. Under common\nhardness assumptions, neither the dependence on $t$ in the exponent nor the\ndependence on $n$ can be reduced\n[DBLP:journals/tcs/HanakaKS21,DBLP:journals/jcss/EibenLM21,DBLP:journals/talg/LokshtanovMS18].\nOur framework can be applied to other cut problems like Min-Edge-Expansion,\nSparsest-Cut, Densest-Cut, $\\beta$-Balanced-Min-Cut, and Min-Bisection. It also\nworks in the setting with arbitrary weights and directed edges."}, {"id": "2101.00781", "title": "Recommending Accurate and Diverse Items Using Bilateral Branch Network", "abstract": "Recommender systems have played a vital role in online platforms due to the\nability of incorporating users' personal tastes. Beyond accuracy, diversity has\nbeen recognized as a key factor in recommendation to broaden user's horizons as\nwell as to promote enterprises' sales. However, the trading-off between\naccuracy and diversity remains to be a big challenge, and the data and user\nbiases have not been explored yet.\n  In this paper, we develop an adaptive learning framework for accurate and\ndiversified recommendation. We generalize recent proposed bi-lateral branch\nnetwork in the computer vision community from image classification to item\nrecommendation. Specifically, we encode domain level diversity by adaptively\nbalancing accurate recommendation in the conventional branch and diversified\nrecommendation in the adaptive branch of a bilateral branch network. We also\ncapture user level diversity using a two-way adaptive metric learning backbone\nnetwork in each branch. We conduct extensive experiments on three real-world\ndatasets. Results demonstrate that our proposed approach consistently\noutperforms the state-of-the-art baselines."}, {"id": "2101.00945", "title": "Active Electric Dipole Energy Sources: Transduction via Electric Scalar\n  and Vector Potentials", "abstract": "An active electrical network contains a voltage or current source that\ncreates electromagnetic energy through a method of transduction that enables\nthe separation of opposite polarity charges from an external source. The end\nresult is the creation of an active dipole with a permanent polarisation and a\nnon-zero electric vector curl. The external energy input impresses a force per\nunit charge within the voltage source, to form an active physical dipole in the\nstatic case, or an active Hertzian dipole in the time dependent case. This\nsystem is the dual of an electromagnet or permanent magnet excited by a\ncirculating electrical current or fictitious bound current respectively, which\nsupplies a magnetomotive force described by a magnetic vector potential with a\nmagnetic geometric phase proportional to the enclosed magnetic flux. In\ncontrast, the active electric dipole may be described macroscopically by a\ncirculating fictitious magnetic current boundary source described by an\nelectric vector potential with an electric geometric phase proportional to the\nenclosed electric flux density. This macroscopic description of an active\ndipole is an average description of some underlying microscopic description\nexhibiting emergent nonconservative behaviour not found in classical\nconservative laws of electrodynamics. We show that the electromotive force\nproduced by an active dipole must have both electric scalar and vector\npotential components to account for the magnitude of the voltage it produces.\nFollowing this we analyse an active cylindrical dipole in terms of scalar and\nvector potential and confirm that the electromotive force produced, and hence\npotential difference across the terminals is a combination of vector and scalar\npotential difference depending on aspect ratio of the dipole."}, {"id": "2101.01442", "title": "Single-preparation unsupervised quantum machine learning: concepts and\n  applications", "abstract": "The term \"machine learning\" especially refers to algorithms that derive\nmappings, i.e. intput/output transforms, by using numerical data that provide\ninformation about considered transforms. These transforms appear in many\nproblems, related to classification/clustering, regression, system\nidentification, system inversion and input signal restoration/separation. We\nhere first analyze the connections between all these problems, in the classical\nand quantum frameworks. We then focus on their most challenging versions,\ninvolving quantum data and/or quantum processing means, and unsupervised, i.e.\nblind, learning. Moreover, we propose the quite general concept of\nSIngle-Preparation Quantum Information Processing (SIPQIP). The resulting\nmethods only require a single instance of each state, whereas usual methods\nhave to very accurately create many copies of each fixed state. We apply our\nSIPQIP concept to various tasks, related to system identification (blind\nquantum process tomography or BQPT, blind Hamiltonian parameter estimation or\nBHPE, blind quantum channel identification/estimation, blind phase estimation),\nsystem inversion and state estimation (blind quantum source separation or BQSS,\nblind quantum entangled state restoration or BQSR, blind quantum channel\nequalization) and classification. Numerical tests show that our framework\nmoreover yields much more accurate estimation than the standard\nmultiple-preparation approach. Our methods are especially useful in a quantum\ncomputer, that we propose to more briefly call a \"quamputer\": BQPT and BHPE\nsimplify the characterization of the gates of quamputers; BQSS and BQSR allow\none to design quantum gates that may be used to compensate for the\nnon-idealities that alter states stored in quantum registers, and they open the\nway to the much more general concept of self-adaptive quantum gates (see longer\nversion of abstract in paper)."}, {"id": "2101.01446", "title": "The Balmer spectrum of certain Deligne-Mumford stacks", "abstract": "We consider a Deligne-Mumford stack $X$ which is the quotient of an affine\nscheme $\\operatorname{Spec}A$ by the action of a finite group $G$ and show that\nthe Balmer spectrum of the tensor triangulated category of perfect complexes on\n$X$ is homeomorphic to the space of homogeneous prime ideals in the group\ncohomology ring $H^*(G,A)$."}, {"id": "2101.01473", "title": "Learning Sign-Constrained Support Vector Machines", "abstract": "Domain knowledge is useful to improve the generalization performance of\nlearning machines. Sign constraints are a handy representation to combine\ndomain knowledge with learning machine. In this paper, we consider constraining\nthe signs of the weight coefficients in learning the linear support vector\nmachine, and develop two optimization algorithms for minimizing the empirical\nrisk under the sign constraints. One of the two algorithms is based on the\nprojected gradient method, in which each iteration of the projected gradient\nmethod takes $O(nd)$ computational cost and the sublinear convergence of the\nobjective error is guaranteed. The second algorithm is based on the Frank-Wolfe\nmethod that also converges sublinearly and possesses a clear termination\ncriterion. We show that each iteration of the Frank-Wolfe also requires $O(nd)$\ncost. Furthermore, we derive the explicit expression for the minimal iteration\nnumber to ensure an $\\epsilon$-accurate solution by analyzing the curvature of\nthe objective function. Finally, we empirically demonstrate that the sign\nconstraints are a promising technique when similarities to the training\nexamples compose the feature vector."}, {"id": "2101.01945", "title": "Fine-Grained Complexity of Regular Path Queries", "abstract": "A regular path query (RPQ) is a regular expression q that returns all node\npairs (u, v) from a graph database that are connected by an arbitrary path\nlabelled with a word from L(q). The obvious algorithmic approach to\nRPQ-evaluation (called PG-approach), i.e., constructing the product graph\nbetween an NFA for q and the graph database, is appealing due to its simplicity\nand also leads to efficient algorithms. However, it is unclear whether the\nPG-approach is optimal. We address this question by thoroughly investigating\nwhich upper complexity bounds can be achieved by the PG-approach, and we\ncomplement these with conditional lower bounds (in the sense of the\nfine-grained complexity framework). A special focus is put on enumeration and\ndelay bounds, as well as the data complexity perspective. A main insight is\nthat we can achieve optimal (or near optimal) algorithms with the PG-approach,\nbut the delay for enumeration is rather high (linear in the database). We\nexplore three successful approaches towards enumeration with sub-linear delay:\nsuper-linear preprocessing, approximations of the solution sets, and restricted\nclasses of RPQs."}, {"id": "2101.02062", "title": "Dispersion control in pressure-driven flow through bowed rectangular\n  microchannels", "abstract": "In fully-developed pressure-driven flow, the spreading of a dissolved solute\nis enhanced in the flow direction due to transverse velocity variations in a\nphenomenon now commonly referred to as Taylor-Aris dispersion. It is well\nunderstood that the characteristics of the dispersion are sensitive to the\nchannel's cross-sectional geometry. Here we demonstrate a method for\nmanipulation of dispersion in a single rectangular microchannel via controlled\ndeformation of its upper wall. Using a rapidly prototyped multi-layer\nmicrochip, the channel wall is deformed by a controlled pressure source\nallowing us to characterize the dependence of the dispersion on the deflection\nof the channel wall and overall channel aspect ratio. For a given channel\naspect ratio, an optimal deformation to minimize dispersion is found,\nconsistent with prior numerical and theoretical predictions. Our experimental\nmeasurements are also compared directly to numerical predictions using an\nidealized geometry."}, {"id": "2101.02115", "title": "Adversarial Robustness by Design through Analog Computing and Synthetic\n  Gradients", "abstract": "We propose a new defense mechanism against adversarial attacks inspired by an\noptical co-processor, providing robustness without compromising natural\naccuracy in both white-box and black-box settings. This hardware co-processor\nperforms a nonlinear fixed random transformation, where the parameters are\nunknown and impossible to retrieve with sufficient precision for large enough\ndimensions. In the white-box setting, our defense works by obfuscating the\nparameters of the random projection. Unlike other defenses relying on\nobfuscated gradients, we find we are unable to build a reliable backward\ndifferentiable approximation for obfuscated parameters. Moreover, while our\nmodel reaches a good natural accuracy with a hybrid backpropagation - synthetic\ngradient method, the same approach is suboptimal if employed to generate\nadversarial examples. We find the combination of a random projection and\nbinarization in the optical system also improves robustness against various\ntypes of black-box attacks. Finally, our hybrid training method builds robust\nfeatures against transfer attacks. We demonstrate our approach on a VGG-like\narchitecture, placing the defense on top of the convolutional features, on\nCIFAR-10 and CIFAR-100. Code is available at\nhttps://github.com/lightonai/adversarial-robustness-by-design."}, {"id": "2101.02172", "title": "Affine connections on complex compact surfaces and Riccati distributions", "abstract": "Let $M$ be a complex surface. We show that there is a one-to-one\ncorrespondence between torsion-free affine connections on $M$ and Riccati\ndistributions on $\\mathbb{P}(TM)$. Furthermore, if $M$ is compact, then this\ncorrespondence induces a one-to-one correspondence between affine structures on\n$M$ and Riccati foliations on $\\mathbb{P}(TM)$."}, {"id": "2101.02364", "title": "Hyers-Ulam stability of the first order difference equation generated by\n  linear maps", "abstract": "Hyers-Ulam stability of the difference equation $ z_{n+1} = a_nz_n + b_n $ is\ninvestigated. If $ \\prod_{j=1}^{n}|a_j| $ has subexponential growth rate, then\ndifference equation generated by linear maps has no Hyers-Ulam stability. Other\ncomplementary results are also found where $ \\lim_{n \\rightarrow \\infty}\n\\left(\\prod_{j=1}^{n}|a_j| \\right)^{\\frac{1}{n}} $ is greater or less than one.\nThese results contain Hyers-Ulam stability of the first order linear difference\nequation with periodic coefficients also."}, {"id": "2101.03194", "title": "Pretty good quantum state transfer on isotropic and anisotropic\n  Heisenberg spin chains with tailored site dependent exchange couplings", "abstract": "Using a global optimization algorithm we obtain spin chains with\nsite-dependent exchange coefficients which allow almost perfect quantum state\ntransfer between the extremes of the chains without any further time-dependent\nexternal control. We consider chains with isotropic and anisotropic Heisenberg\nHamiltonian with up to 100 spins. The method allow us to choose the arrival of\nthe transferred state by changing the range available to the exchange coupling\nstrengths. We consider short transferred times, in particular shorter than\nthose achievable with known time-dependent control schemes. The chains obtained\nwith the optimization method show some remarkable and interesting traits as,\nfor instance, the scaling of the magnitude of the exchange couplings needed to\nachieve near perfect state transfer with the length of the chain and the\narrival time. This scaling makes it possible to decide if the chain with\nsite-dependent coefficients can be implemented in an actual system according to\nthe range of interactions allowed in it. We compare the robustness of the\ntransmission protocol against static disorder on the exchange coefficients\nusing different figures of merit, which allow us to conclude that the isotropic\nHeisenberg chain is the best option when compared with anisotropic chains. This\ncomparison is relevant since the method allow us to start with chains that all\nachieve near perfect quantum state transfer, regime that was not available\npreviously in these chains without time-dependent external control."}, {"id": "2101.03850", "title": "Deep Neural Networks to Recover Unknown Physical Parameters from\n  Oscillating Time Series", "abstract": "Deep neural networks (DNNs) are widely used in pattern-recognition tasks for\nwhich a human comprehensible, quantitative description of the data-generating\nprocess, e.g., in the form of equations, cannot be achieved. While doing so,\nDNNs often produce an abstract (entangled and non-interpretable) representation\nof the data-generating process. This is one of the reasons why DNNs are not\nextensively used in physics-signal processing: physicists generally require\ntheir analyses to yield quantitative information about the studied systems. In\nthis article we use DNNs to disentangle components of oscillating time series,\nand recover meaningful information. We show that, because DNNs can find useful\nabstract feature representations, they can be used when prior knowledge about\nthe signal-generating process exists, but is not complete, as it is\nparticularly the case in \"new-physics\" searches. To this aim, we train our DNN\non synthetic oscillating time series to perform two tasks: a regression of the\nsignal latent parameters and signal denoising by an Autoencoder-like\narchitecture. We show that the regression and denoising performance is similar\nto those of least-square curve fittings (LS-fit) with true latent parameters'\ninitial guesses, in spite of the DNN needing no initial guesses at all. We then\nexplore applications in which we believe our architecture could prove useful\nfor time-series processing in physics, when prior knowledge is incomplete. As\nan example, we employ DNNs as a tool to inform LS-fits when initial guesses are\nunknown. We show that the regression can be performed on some latent\nparameters, while ignoring the existence of others. Because the Autoencoder\nneeds no prior information about the physical model, the remaining unknown\nlatent parameters can still be captured, thus making use of partial prior\nknowledge, while leaving space for data exploration and discoveries."}, {"id": "2101.04645", "title": "Double-Adversarial Activation Anomaly Detection: Adversarial\n  Autoencoders are Anomaly Generators", "abstract": "Anomaly detection is a challenging task for machine learning algorithms due\nto the inherent class imbalance. It is costly and time-demanding to manually\nanalyse the observed data, thus usually only few known anomalies if any are\navailable. Inspired by generative models and the analysis of the hidden\nactivations of neural networks, we introduce a novel unsupervised anomaly\ndetection method called DA3D. Here, we use adversarial autoencoders to generate\nanomalous counterexamples based on the normal data only. These artificial\nanomalies used during training allow the detection of real, yet unseen\nanomalies. With our novel generative approach, we transform the unsupervised\ntask of anomaly detection to a supervised one, which is more tractable by\nmachine learning and especially deep learning methods. DA3D surpasses the\nperformance of state-of-the-art anomaly detection methods in a purely\ndata-driven way, where no domain knowledge is required."}, {"id": "2101.04864", "title": "Theory of competing Chern-Simons orders and emergent phase transitions", "abstract": "Based on the Chern-Simons fermionization of spin-1/2 operators, we propose a\nsystematic framework to investigate the competition between emergent phases in\nfrustrated two-dimensional XY quantum magnets. Application of the method to the\nantiferromagnetic honeycomb spin-1/2 $J_1$-$J_2$ XY model reveals an\nunconventional phase transition between two Chern-Simons orders: the\nChern-Simons superconductor and the exciton insulator of Chern-Simons fermions.\nWe show that in the spin language, this transition translates to the transition\nfrom the planar N\\'{e}el state to the non-uniform chiral spin-liquid that was\nproposed earlier in the literature. Namely, the Chern-Simons superconductor\ndescribes the planar N\\'{e}el state, while the Chern-Simons exciton insulator\ncorresponds to the non-uniform chiral spin-liquid. These results are further\nconfirmed by our high-precision tensor network calculation, which provides the\nfirst numerical evidence for the transition from N\\'{e}el order to a\nnon-uniform chiral spin-liquid. We argue that the developed method can be\napplied to other frustrated quantum magnets of XXZ type and can detect\nunconventional phase transitions."}, {"id": "2101.05257", "title": "Irrationality and Transcendence Criteria for Infinite Series in\n  Isabelle/HOL", "abstract": "We give an overview of our formalizations in the proof assistant Isabelle/HOL\nof certain irrationality and transcendence criteria for infinite series from\nthree different research papers: by Erd\\H{o}s and Straus (1974), Han\\v{c}l\n(2002), and Han\\v{c}l and Rucki (2005). Our formalizations in Isabelle/HOL can\nbe found on the Archive of Formal Proofs. Here we describe selected aspects of\nthe formalization and discuss what this reveals about the use and potential of\nIsabelle/HOL in formalizing modern mathematical research, particularly in these\nparts of number theory and analysis."}, {"id": "2101.06088", "title": "Exploring the sensitivity of hadron colliders to non-universality in\n  heavy neutral currents", "abstract": "We present sensitivity projections for discovering a heavy resonance decaying\nto electron and muon pairs and for probing the charged lepton non-universality\nin such decays at the HL-LHC and FCC-hh. The analysis takes into account the\nexpected differences in the reconstruction efficiencies and the dilepton mass\nresolutions for dielectron and dimuon final states. We demonstrate how the\nanalyses at HL-LHC naturally paves the way for a FCC-hh machine thereby\nunderlining its importance."}, {"id": "2101.06104", "title": "Modeling and Analysis of Three Properties of Mobile Interactive Systems\n  Based on Variable Petri Nets", "abstract": "Due to the mobility and frequent disconnections, the correctness of mobile\ninteraction systems, such as mobile robot systems and mobile payment systems,\nare often difficult to analyze. This paper introduces three critical properties\nof systems, called system connectivity, interaction soundness and data\nvalidity, and presents a related modeling and analysis method, based on a kind\nof Petri nets called VPN. For a given system, a model including component nets\nand interaction structure nets is constructed by using VPNs. The component net\ndescribes the internal process of each component, while the interaction\nstructure net reflects the dynamic interaction between components. Based on\nthis model, three properties are defined and analyzed. The case study of a\npractical mobile payment system shows the effectiveness of the proposed method."}, {"id": "2101.06691", "title": "Stability of Boolean function classes with respect to clones of linear\n  functions", "abstract": "We consider classes of Boolean functions stable under compositions both from\nthe right and from the left with clones. Motivated by the question how many\nproperties of Boolean functions can be defined by means of linear equations, we\nfocus on stability under compositions with the clone of linear idempotent\nfunctions. It follows from a result by Sparks that there are countably many\nsuch linearly definable classes of Boolean functions. In this paper, we refine\nthis result by completely describing these classes. This work is tightly\nrelated with the theory of function minors, stable classes, clonoids, and\nhereditary classes, topics that have been widely investigated in recent years\nby several authors including Maurice Pouzet and his coauthors."}, {"id": "2101.06729", "title": "A tissue-fraction estimation-based segmentation method for quantitative\n  dopamine transporter SPECT", "abstract": "Quantitative measures of dopamine transporter (DaT) uptake in caudate,\nputamen, and globus pallidus (GP) have potential as biomarkers for measuring\nthe severity of Parkinson disease. Reliable quantification of this uptake\nrequires accurate segmentation of the considered regions. However, segmentation\nof these regions from DaT-SPECT images is challenging, a major reason being\npartial-volume effects (PVEs), which arise from the limited system resolution\nand reconstruction of images over finite-sized voxel grids. The latter leads to\ntissue-fraction effects (TFEs). Thus, there is an important need for methods\nthat can account for the PVEs, including the TFEs, and accurately segment\nDaT-SPECT images. The purpose of this study is to design and objectively\nevaluate a fully automated tissue-fraction estimation-based segmentation method\nthat segments the caudate, putamen, and GP from DaT-SPECT images. The proposed\nmethod estimates the posterior mean of the fractional volumes occupied by the\ncaudate, putamen, and GP within each voxel of a 3-D DaT-SPECT image. The\nestimate is obtained by minimizing a cost function based on the binary\ncross-entropy loss between the true and estimated fractional volumes over a\npopulation of SPECT images. Evaluations using clinically guided highly\nrealistic simulation studies show that the proposed method accurately segmented\nthe caudate, putamen, and GP with high mean Dice similarity coefficients ~ 0.80\nand significantly outperformed (p < 0.01) all other considered segmentation\nmethods. Further, objective evaluation of the proposed method on the task of\nquantifying regional uptake shows that the method yielded reliable\nquantification with low ensemble normalized root mean square error (NRMSE) <\n20% for all the considered regions. The results motivate further evaluation of\nthe method with physical-phantom and patient studies."}, {"id": "2101.06936", "title": "Convergence Rates for Empirical Measures of Markov Chains in Dual and\n  Wasserstein Distances", "abstract": "We consider a Markov chain on $\\mathbb{R}^d$ with invariant measure $\\mu$. We\nare interested in the rate of convergence of the empirical measures towards the\ninvariant measure with respect to various dual distances, including in\nparticular the $1$-Wasserstein distance. The main result of this article is a\nnew upper bound for the expected distance, which is proved by combining a\nFourier expansion with a truncation argument. Our bound matches the known rates\nfor i.i.d. random variables up to logarithmic factors. In addition, we show how\nconcentration inequalities around the mean can be obtained."}, {"id": "2101.07027", "title": "Semiclassical analysis on compact nilmanifolds", "abstract": "In this paper, we develop a semiclassical calculus on compact nil-manifolds.\nAs an application of the former, we obtain asymptotics such as generalised Weyl\nlaws for positive Rockland operators on any graded compact nil-manifolds. We\nalso define and study semiclassical limits and quantum limits in this context."}, {"id": "2101.07220", "title": "A Tensor-Based Formulation of Hetero-functional Graph Theory", "abstract": "Recently, hetero-functional graph theory (HFGT) has developed as a means to\nmathematically model the structure of large-scale complex flexible engineering\nsystems. It does so by fusing concepts from network science and model-based\nsystems engineering (MBSE). For the former, it utilizes multiple graph-based\ndata structures to support a matrix-based quantitative analysis. For the\nlatter, HFGT inherits the heterogeneity of conceptual and ontological\nconstructs found in model-based systems engineering including system form,\nsystem function, and system concept. These diverse conceptual constructs\nindicate multi-dimensional rather than two-dimensional relationships. This\npaper provides the first tensor-based treatment of hetero-functional graph\ntheory. In particular, it addresses the ``system concept\" and the\nhetero-functional adjacency matrix from the perspective of tensors and\nintroduces the hetero-functional incidence tensor as a new data structure. The\ntensor-based formulation described in this work makes a stronger tie between\nHFGT and its ontological foundations in MBSE. Finally, the tensor-based\nformulation facilitates several analytical results that provide an\nunderstanding of the relationships between HFGT and multi-layer networks."}, {"id": "2101.07283", "title": "Robust measurement of wave function topology on NISQ quantum computers", "abstract": "Topological quantum phases of quantum materials are defined through their\ntopological invariants. These topological invariants are quantities that\ncharacterize the global geometrical properties of the quantum wave functions\nand thus are immune to local noise. Here, we present a strategy to measure\ntopological invariants on quantum computers. We show that our strategy can be\neasily integrated with the variational quantum eigensolver (VQE) so that the\ntopological properties of generic quantum many-body states can be characterized\non current quantum hardware. We demonstrate the robust nature of the method by\nmeasuring topological invariants for both non-interacting and interacting\nmodels, and map out interacting quantum phase diagrams on quantum simulators\nand IBM quantum hardware."}, {"id": "2101.07499", "title": "Fourier multipliers for Hardy spaces on graded Lie groups", "abstract": "In this paper, we investigate the $H^p(G) \\rightarrow L^p(G)$, $0< p \\leq 1$,\nboundedness of multiplier operators defined via group Fourier transform on a\ngraded Lie group $G$, where $H^p(G)$ is the Hardy space on $G$. Our main result\nextends those obtained in [Colloq. Math. \\textbf{165} (2021), 1--30], where the\n$L^1(G)\\rightarrow L^{1,\\infty}(G)$ and $L^p(G) \\rightarrow L^p(G)$, $1< p\n<\\infty$, boundedness of such Fourier multiplier operators were proved."}, {"id": "2101.07711", "title": "Resource Bisimilarity in Petri Nets is Decidable", "abstract": "Petri nets are a popular formalism for modeling and analyzing distributed\nsystems. Tokens in Petri net models can represent the control flow state or\nresources produced/consumed by transition firings. We define a resource as a\npart (a submultiset) of Petri net markings and call two resources equivalent\nwhen replacing one of them with another in any marking does not change the\nobservable Petri net behavior. We consider resource similarity and resource\nbisimilarity, two congruent restrictions of bisimulation equivalence on Petri\nnet markings. Previously it was proved that resource similarity (the largest\ncongruence included in bisimulation equivalence) is undecidable. Here we\npresent an algorithm for checking resource bisimilarity, thereby proving that\nthis relation (the largest congruence included in bisimulation equivalence that\nis a bisimulation) is decidable. We also give an example of two resources in a\nPetri net that are similar but not bisimilar."}, {"id": "2101.07808", "title": "Randomizing multi-product formulas for Hamiltonian simulation", "abstract": "Quantum simulation, the simulation of quantum processes on quantum computers,\nsuggests a path forward for the efficient simulation of problems in\ncondensed-matter physics, quantum chemistry, and materials science. While the\nmajority of quantum simulation algorithms are deterministic, a recent surge of\nideas has shown that randomization can greatly benefit algorithmic performance.\nIn this work, we introduce a scheme for quantum simulation that unites the\nadvantages of randomized compiling on the one hand and higher-order\nmulti-product formulas, as they are used for example in\nlinear-combination-of-unitaries (LCU) algorithms or quantum error mitigation,\non the other hand. In doing so, we propose a framework of randomized sampling\nthat is expected to be useful for programmable quantum simulators and present\ntwo new multi-product formula algorithms tailored to it. Our framework reduces\nthe circuit depth by circumventing the need for oblivious amplitude\namplification required by the implementation of multi-product formulas using\nstandard LCU methods, rendering it especially useful for early quantum\ncomputers used to estimate the dynamics of quantum systems instead of\nperforming full-fledged quantum phase estimation. Our algorithms achieve a\nsimulation error that shrinks exponentially with the circuit depth. To\ncorroborate their functioning, we prove rigorous performance bounds as well as\nthe concentration of the randomized sampling procedure. We demonstrate the\nfunctioning of the approach for several physically meaningful examples of\nHamiltonians, including fermionic systems and the Sachdev-Ye-Kitaev model, for\nwhich the method provides a favorable scaling in the effort."}, {"id": "2101.07885", "title": "Embedding calculus for surfaces", "abstract": "We prove convergence of Goodwillie-Weiss' embedding calculus for spaces of\nembeddings into a manifold of dimension at most two, so in particular for\ndiffeomorphisms between surfaces. We also relate the Johnson filtration of the\nmapping class group of a surface to a certain filtration arising from embedding\ncalculus."}, {"id": "2101.08064", "title": "Interpolation by multivariate polynomials in convex domains", "abstract": "Let $\\Omega$ be a convex open set in $\\mathbb R^n$ and let $\\Lambda_k$ be a\nfinite subset of $\\Omega$. We find necessary geometric conditions for\n$\\Lambda_k$ to be interpolating for the space of multivariate polynomials of\ndegree at most $k$. Our results are asymptotic in $k$. The density conditions\nobtained match precisely the necessary geometric conditions that sampling sets\nare known to satisfy, and they are expressed in terms of the equilibrium\npotential of the convex set. Moreover, we prove that in the particular case of\nthe unit ball, for $k$ large enough, there is no family of orthogonal\nreproducing kernels in the space of polynomials of degree at most $k$."}, {"id": "2101.08354", "title": "Enhancing Generative Models via Quantum Correlations", "abstract": "Generative modeling using samples drawn from the probability distribution\nconstitutes a powerful approach for unsupervised machine learning. Quantum\nmechanical systems can produce probability distributions that exhibit quantum\ncorrelations which are difficult to capture using classical models. We show\ntheoretically that such quantum correlations provide a powerful resource for\ngenerative modeling. In particular, we provide an unconditional proof of\nseparation in expressive power between a class of widely-used generative\nmodels, known as Bayesian networks, and its minimal quantum extension. We show\nthat this expressivity advantage is associated with quantum nonlocality and\nquantum contextuality. Furthermore, we numerically test this separation on\nstandard machine learning data sets and show that it holds for practical\nproblems. The possibility of quantum advantage demonstrated in this work not\nonly sheds light on the design of useful quantum machine learning protocols but\nalso provides inspiration to draw on ideas from quantum foundations to improve\npurely classical algorithms."}, {"id": "2101.08551", "title": "Customer Price Sensitivities in Competitive Automobile Insurance Markets", "abstract": "Insurers are increasingly adopting more demand-based strategies to\nincorporate the indirect effect of premium changes on their policyholders'\nwillingness to stay. However, since in practice both insurers' renewal premia\nand customers' responses to these premia typically depend on the customer's\nlevel of risk, it remains challenging in these strategies to determine how to\nproperly control for this confounding. We therefore consider a causal inference\napproach in this paper to account for customers' price sensitivity and to\ndeduce optimal, multi-period profit maximizing premium renewal offers. More\nspecifically, we extend the discrete treatment framework of Guelman and\nGuill\\'en (2014) by Extreme Gradient Boosting, or XGBoost, and by multiple\nimputation to better account for the uncertainty in the counterfactual\nresponses. We additionally introduce the continuous treatment framework with\nXGBoost to the insurance literature to allow identification of the exact\noptimal renewal offers and account for any competition in the market by\nincluding competitor offers. The application of the two treatment frameworks to\na Dutch automobile insurance portfolio suggests that a policy's competitiveness\nin the market is crucial for a customer's price sensitivity and that XGBoost is\nmore appropriate to describe this than the traditional logistic regression.\nMoreover, an efficient frontier of both frameworks indicates that substantially\nmore profit can be gained on the portfolio than realized, also already with\nless churn and in particular if we allow for continuous rate changes. A\nmulti-period renewal optimization confirms these findings and demonstrates that\nthe competitiveness enables temporal feedback of previous rate changes on\nfuture demand."}, {"id": "2101.09163", "title": "The Next Decade of Telecommunications Artificial Intelligence", "abstract": "It has been an exciting journey since the mobile communications and\nartificial intelligence were conceived 37 years and 64 years ago. While both\nfields evolved independently and profoundly changed communications and\ncomputing industries, the rapid convergence of 5G and deep learning is\nbeginning to significantly transform the core communication infrastructure,\nnetwork management and vertical applications. The paper first outlines the\nindividual roadmaps of mobile communications and artificial intelligence in the\nearly stage, with a concentration to review the era from 3G to 5G when AI and\nmobile communications started to converge. With regard to telecommunications\nartificial intelligence, the paper further introduces in detail the progress of\nartificial intelligence in the ecosystem of mobile communications. The paper\nthen summarizes the classifications of AI in telecom ecosystems along with its\nevolution paths specified by various international telecommunications\nstandardization bodies. Towards the next decade, the paper forecasts the\nprospective roadmap of telecommunications artificial intelligence. In line with\n3GPP and ITU-R timeline of 5G & 6G, the paper further explores the network\nintelligence following 3GPP and ORAN routes respectively, experience and\nintention driven network management and operation, network AI signalling\nsystem, intelligent middle-office based BSS, intelligent customer experience\nmanagement and policy control driven by BSS and OSS convergence, evolution from\nSLA to ELA, and intelligent private network for verticals. The paper is\nconcluded with the vision that AI will reshape the future B5G or 6G landscape\nand we need pivot our R&D, standardizations, and ecosystem to fully take the\nunprecedented opportunities."}, {"id": "2101.09175", "title": "\"FISTA\" in Banach spaces with adaptive discretisations", "abstract": "FISTA is a popular convex optimisation algorithm which is known to converge\nat an optimal rate whenever a minimiser is contained in a suitable Hilbert\nspace. We propose a modified algorithm where each iteration is performed in a\nsubset which is allowed to change at every iteration. Sufficient conditions are\nprovided for guaranteed convergence, although at a reduced rate depending on\nthe conditioning of the specific problem. These conditions have a natural\ninterpretation when a minimiser exists in an underlying Banach space. Typical\nexamples are L1-penalised reconstructions where we provide detailed theoretical\nand numerical analysis."}, {"id": "2101.09391", "title": "Learning Setup Policies: Reliable Transition Between Locomotion\n  Behaviours", "abstract": "Dynamic platforms that operate over many unique terrain conditions typically\nrequire many behaviours. To transition safely, there must be an overlap of\nstates between adjacent controllers. We develop a novel method for training\nsetup policies that bridge the trajectories between pre-trained Deep\nReinforcement Learning (DRL) policies. We demonstrate our method with a\nsimulated biped traversing a difficult jump terrain, where a single policy\nfails to learn the task, and switching between pre-trained policies without\nsetup policies also fails. We perform an ablation of key components of our\nsystem, and show that our method outperforms others that learn transition\npolicies. We demonstrate our method with several difficult and diverse terrain\ntypes, and show that we can use setup policies as part of a modular control\nsuite to successfully traverse a sequence of complex terrains. We show that\nusing setup policies improves the success rate for traversing a single\ndifficult jump terrain (from 51.3% success rate with the best comparative\nmethod to 82.2%), and traversing a random sequence of difficult obstacles (from\n1.9% without setup policies to 71.2%)."}, {"id": "2101.09605", "title": "Kernel regression analysis of tie-breaker designs", "abstract": "Tie-breaker experimental designs are hybrids of Randomized Controlled Trials\n(RCTs) and Regression Discontinuity Designs (RDDs) in which subjects with\nmoderate scores are placed in an RCT while subjects with extreme scores are\ndeterministically assigned to the treatment or control group. In settings where\nit is unfair or uneconomical to deny the treatment to the more deserving\nrecipients, the tie-breaker design (TBD) trades off the practical advantages of\nthe RDD with the statistical advantages of the RCT. The practical costs of the\nrandomization in TBDs can be hard to quantify in generality, while the\nstatistical benefits conferred by randomization in TBDs have only been studied\nunder linear and quadratic models. In this paper, we discuss and quantify the\nstatistical benefits of TBDs without using parametric modelling assumptions. If\nthe goal is estimation of the average treatment effect or the treatment effect\nat more than one score value, the statistical benefits of using a TBD over an\nRDD are apparent. If the goal is nonparametric estimation of the mean treatment\neffect at merely one score value, we prove that about 2.8 times more subjects\nare needed for an RDD in order to achieve the same asymptotic mean squared\nerror. We further demonstrate using both theoretical results and simulations\nfrom the Angrist and Lavy (1999) classroom size dataset, that larger\nexperimental radii choices for the TBD lead to greater statistical efficiency"}, {"id": "2101.10271", "title": "Rigidity of topological entropy of boundary maps associated to Fuchsian\n  groups", "abstract": "Given a closed, orientable surface of constant negative curvature and genus\n$g \\ge 2$, we study a family of generalized Bowen-Series boundary maps and\nprove the following rigidity result: in this family the topological entropy is\nconstant and depends only on the genus of the surface. We give an explicit\nformula for this entropy and show that the value of the topological entropy\nalso stays constant in the Teichm\\\"uller space of the surface. The proofs use\nconjugation to maps of constant slope."}, {"id": "2101.10316", "title": "Conjugator length in Thompson's groups", "abstract": "We prove Thompson's group $F$ has quadratic conjugator length function. That\nis, for any two conjugate elements of $F$ of length $n$ or less, there exists\nan element of $F$ of length $O(n^2)$ that conjugates one to the other.\nMoreover, there exist conjugate pairs of elements of $F$ of length at most $n$\nsuch that the shortest conjugator between them has length $\\Omega(n^2)$. This\nlatter statement holds for $T$ and $V$ as well."}, {"id": "2101.10337", "title": "Extracting Dark-Matter Velocities from Halo Masses: A Reconstruction\n  Conjecture", "abstract": "Increasing attention has recently focused on non-traditional dark-matter\nproduction mechanisms which result in primordial dark-matter velocity\ndistributions with highly non-thermal shapes. In this paper, we undertake an\nassessment of how the detailed shape of a general dark-matter velocity\ndistribution impacts structure formation in the non-linear regime. In\nparticular, we investigate the impact on the halo-mass and subhalo-mass\nfunctions, as well as on astrophysical observables such as satellite and\ncluster-number counts. We find that many of the standard expectations no longer\nhold in situations in which this velocity distribution takes a highly\nnon-trivial, even multi-modal shape. For example, we find that the nominal\nfree-streaming scale alone becomes insufficient to characterize the effect of\nfree-streaming on structure formation. In addition, we propose a simple\none-line conjecture which can be used to \"reconstruct\" the primordial\ndark-matter velocity distribution directly from the shape of the halo-mass\nfunction. Although our conjecture is completely heuristic, we show that it\nsuccessfully reproduces the salient features of the underlying dark-matter\nvelocity distribution even for non-trivial distributions which are highly\nnon-thermal and/or multi-modal, such as might occur for non-minimal dark\nsectors. Moreover, since our approach relies only on the halo-mass function,\nour conjecture provides a method of probing dark-matter properties even for\nscenarios in which the dark and visible sectors interact only gravitationally."}, {"id": "2101.10556", "title": "Self Sparse Generative Adversarial Networks", "abstract": "Generative Adversarial Networks (GANs) are an unsupervised generative model\nthat learns data distribution through adversarial training. However, recent\nexperiments indicated that GANs are difficult to train due to the requirement\nof optimization in the high dimensional parameter space and the zero gradient\nproblem. In this work, we propose a Self Sparse Generative Adversarial Network\n(Self-Sparse GAN) that reduces the parameter space and alleviates the zero\ngradient problem. In the Self-Sparse GAN, we design a Self-Adaptive Sparse\nTransform Module (SASTM) comprising the sparsity decomposition and feature-map\nrecombination, which can be applied on multi-channel feature maps to obtain\nsparse feature maps. The key idea of Self-Sparse GAN is to add the SASTM\nfollowing every deconvolution layer in the generator, which can adaptively\nreduce the parameter space by utilizing the sparsity in multi-channel feature\nmaps. We theoretically prove that the SASTM can not only reduce the search\nspace of the convolution kernel weight of the generator but also alleviate the\nzero gradient problem by maintaining meaningful features in the Batch\nNormalization layer and driving the weight of deconvolution layers away from\nbeing negative. The experimental results show that our method achieves the best\nFID scores for image generation compared with WGAN-GP on MNIST, Fashion-MNIST,\nCIFAR-10, STL-10, mini-ImageNet, CELEBA-HQ, and LSUN bedrooms, and the relative\ndecrease of FID is 4.76% ~ 21.84%."}, {"id": "2101.10980", "title": "A note on Kauzmann's paradox", "abstract": "The rapid structural and vibrational entropy decrease with decreasing\ntemperature in undercooled liquids is explained in terms of the disappearance\nof local structural instabilities, which freeze in at the glass temperature as\nboson peak modes and low temperature tunneling states. At the Kauzmann\ntemperature, their density extrapolates to zero, as evidenced by neutron and\nheat capacity data in liquid selenium."}, {"id": "2101.11153", "title": "Constraining gravitational wave amplitude birefringence and Chern-Simons\n  gravity with GWTC-2", "abstract": "We perform a new test of general relativity (GR) with signals from GWTC-2,\nthe LIGO and Virgo catalog of gravitational wave detections. We search for the\npresence of amplitude birefringence, in which left versus right circularly\npolarized modes of gravitational waves are exponentially enhanced and\nsuppressed during propagation. Such an effect is present in various beyond-GR\ntheories but is absent in GR. We constrain the amount of amplitude\nbirefringence consistent with the data through an opacity parameter $\\kappa$,\nwhich we bound to be $\\kappa \\lesssim 0.74 \\textrm{ Gpc}^{-1}$. We then use\nthese theory-agnostic results to constrain Chern-Simons gravity, a beyond-GR\ntheory with motivations in quantum gravity. We bound the canonical Chern-Simons\nlengthscale to be $\\ell_0 \\lesssim 1.0 \\times 10^3$ km, improving on previous\nlong-distance measurement results by a factor of two."}, {"id": "2101.11156", "title": "Fundamental limits and algorithms for sparse linear regression with\n  sublinear sparsity", "abstract": "We establish exact asymptotic expressions for the normalized mutual\ninformation and minimum mean-square-error (MMSE) of sparse linear regression in\nthe sub-linear sparsity regime. Our result is achieved by a generalization of\nthe adaptive interpolation method in Bayesian inference for linear regimes to\nsub-linear ones. A modification of the well-known approximate message passing\nalgorithm to approach the MMSE fundamental limit is also proposed, and its\nstate evolution is rigorously analyzed. Our results show that the traditional\nlinear assumption between the signal dimension and number of observations in\nthe replica and adaptive interpolation methods is not necessary for sparse\nsignals. They also show how to modify the existing well-known AMP algorithms\nfor linear regimes to sub-linear ones."}, {"id": "2101.11220", "title": "Coherent dynamics of multi-spin $\\rm V_B^-$ centers in hexagonal boron\n  nitride", "abstract": "Hexagonal boron nitride (hBN) has recently been demonstrated to contain\noptically polarized and detected electron spins that can be utilized for\nimplementing qubits and quantum sensors in nanolayered-devices. Understanding\nthe coherent dynamics of microwave driven spins in hBN is of crucial importance\nfor advancing these emerging new technologies. Here, we demonstrate and study\nthe Rabi oscillation and related dynamical phenomena of the negatively charged\nboron vacancy ($\\rm V_B^-$) spins in hBN. We report on different dynamics of\nthe $\\rm V_B^-$ spins at weak and strong magnetic fields. In the former case\nthe defect behaves like a single electron spin system, while in the latter case\nit behaves like a multi-spin system exhibiting the multiple-frequency dynamical\noscillation like clear beat in Ramsey fringes. We also carry out theoretical\nsimulations for the spin dynamics of $\\rm V_B^-$ and reveal that the nuclear\nspins can be driven via the strong electric-nuclear coupling existing in $\\rm\nV_B^-$ center, which can be modulated by the magnetic field and microwave\nfield."}, {"id": "2101.11397", "title": "Optimal decay for a wave-heat system with Coleman-Gurtin thermal law", "abstract": "We study the long-term behaviour of solutions to a one-dimensional coupled\nwave-heat system with Coleman-Gurtin thermal law. Our approach is based on the\nasymptotic theory of $C_0$-semigroups and recent results developed for coupled\ncontrol systems. As our main results, we represent the system as a feedback\ninterconnection between the wave part and the Coleman-Gurtin part and we show\nthat the associated semigroup in the history framework of Dafermos is\npolynomially stable with optimal decay rate $t^{-2}$ as $t\\to\\infty$. In\nparticular, we obtain a sharp estimate for the rate of energy decay of\nclassical solutions to the problem."}, {"id": "2101.11531", "title": "Tropical Support Vector Machines: Evaluations and Extension to Function\n  Spaces", "abstract": "Support Vector Machines (SVMs) are one of the most popular supervised\nlearning models to classify using a hyperplane in an Euclidean space. Similar\nto SVMs, tropical SVMs classify data points using a tropical hyperplane under\nthe tropical metric with the max-plus algebra. In this paper, first we show\ngeneralization error bounds of tropical SVMs over the tropical projective\ntorus. While the generalization error bounds attained via Vapnik-Chervonenkis\n(VC) dimensions in a distribution-free manner still depend on the dimension, we\nalso show numerically and theoretically by extreme value statistics that the\ntropical SVMs for classifying data points from two Gaussian distributions as\nwell as empirical data sets of different neuron types are fairly robust against\nthe curse of dimensionality. Extreme value statistics also underlie the\nanomalous scaling behaviors of the tropical distance between random vectors\nwith additional noise dimensions. Finally, we define tropical SVMs over a\nfunction space with the tropical metric."}, {"id": "2101.11560", "title": "Wisdom of the Contexts: Active Ensemble Learning for Contextual Anomaly\n  Detection", "abstract": "In contextual anomaly detection, an object is only considered anomalous\nwithin a specific context. Most existing methods for CAD use a single context\nbased on a set of user-specified contextual features. However, identifying the\nright context can be very challenging in practice, especially in datasets, with\na large number of attributes. Furthermore, in real-world systems, there might\nbe multiple anomalies that occur in different contexts and, therefore, require\na combination of several \"useful\" contexts to unveil them. In this work, we\nleverage active learning and ensembles to effectively detect complex contextual\nanomalies in situations where the true contextual and behavioral attributes are\nunknown. We propose a novel approach, called WisCon (Wisdom of the Contexts),\nthat automatically creates contexts from the feature set. Our method constructs\nan ensemble of multiple contexts, with varying importance scores, based on the\nassumption that not all useful contexts are equally so. Experiments show that\nWisCon significantly outperforms existing baselines in different categories\n(i.e., active classifiers, unsupervised contextual and non-contextual anomaly\ndetectors, and supervised classifiers) on seven datasets. Furthermore, the\nresults support our initial hypothesis that there is no single perfect context\nthat successfully uncovers all kinds of contextual anomalies, and leveraging\nthe \"wisdom\" of multiple contexts is necessary."}, {"id": "2101.11592", "title": "Fast high-fidelity single-qubit gates for flip-flop qubits in silicon", "abstract": "The flip-flop qubit, encoded in the states with antiparallel donor-bound\nelectron and donor nuclear spins in silicon, showcases long coherence times,\ngood controllability, and, in contrast to other donor-spin-based schemes,\nlong-distance coupling. Electron spin control near the interface, however, is\nlikely to shorten the relaxation time by many orders of magnitude, reducing the\noverall qubit quality factor. Here, we theoretically study the multilevel\nsystem that is formed by the interacting electron and nuclear spins and derive\nanalytical effective two-level Hamiltonians with and without periodic driving.\nWe then propose an optimal control scheme that produces fast and robust\nsingle-qubit gates in the presence of low-frequency noise without relying on\nparametrically restrictive sweet spots. This scheme increases considerably both\nthe relaxation time and the qubit quality factor."}, {"id": "2101.12589", "title": "Low dimensional pinned distance sets via spherical averages", "abstract": "An inequality is derived for the average $t$-energy of pinned distance\nmeasures, where $0 < t < 1$. This refines Mattila's theorem on distance sets to\npinned distance sets, and gives an analogue of Liu's theorem for pinned\ndistance sets of dimension smaller than 1."}, {"id": "2102.00049", "title": "Extension of boundary homeomorphisms to mappings of finite distortion", "abstract": "We provide sufficient conditions so that a homeomorphism of the real line or\nof the circle admits an extension to a mapping of finite distortion in the\nupper half-plane or the disk, respectively. Moreover, we can ensure that the\nquasiconformal dilatation of the extension satisfies certain integrability\nconditions, such as $p$-integrability or exponential integrability. Mappings\nsatisfying the latter integrability condition are also known as David\nhomeomorphisms. Our extension operator is the same as the one used by Beurling\nand Ahlfors in their celebrated work. We prove an optimal bound for the\nquasiconformal dilatation of the Beurling--Ahlfors extension of a homeomorphism\nof the real line, in terms of its symmetric distortion function. More\nspecifically, the quasiconformal dilatation is bounded above by an average of\nthe symmetric distortion function and below by the symmetric distortion\nfunction itself. As a consequence, the quasiconformal dilatation of the\nBeurling--Ahlfors extension of a homeomorphism of the real line is\n(sub)exponentially integrable, is $p$-integrable, or has a $BMO$ majorant if\nand only if the symmetric distortion is (sub)exponentially integrable, is\n$p$-integrable, or has a $BMO$ majorant, respectively. These theorems are all\nnew and reconcile several sufficient extension conditions that have been\nestablished in the past."}, {"id": "2102.00634", "title": "Moment categories and operads", "abstract": "A moment category is endowed with a distinguished set of split idempotents,\ncalled moments, which can be transported along morphisms. Equivalently, a\nmoment category is a category with an active/inert factorisation system\nfulfilling two simple axioms. These axioms imply that the moments of a fixed\nobject form a monoid, actually a left regular band.\n  Each locally finite unital moment category defines a specific type of operad\nwhich records the combinatorics of partitioning moments into elementary ones.\nIn this way the notions of symmetric, non-symmetric and $n$-operad correspond\nto unital moment structures on $\\Gamma$, $\\Delta$ and $\\Theta_n$ respectively.\n  There is an analog of the plus construction of Baez-Dolan taking a unital\nmoment category $\\mathbb{C}$ to a unital hypermoment category $\\mathbb{C}^+$.\nUnder this construction, $\\mathbb{C}$-operads get identified with\n$\\mathbb{C}^+$-monoids, i.e. presheaves on $\\mathbb{C}^+$ satisfying strict\nSegal conditions. We show that the plus construction of Segal's category\n$\\Gamma$ embeds into the dendroidal category $\\Omega$ of Moerdijk-Weiss."}, {"id": "2102.00654", "title": "DPIVE: A Regionalized Location Obfuscation Scheme with Personalized\n  Privacy Levels", "abstract": "The popularity of cyber-physical systems is fueling the rapid growth of\nlocation-based services. This poses the risk of location privacy disclosure.\nEffective privacy preservation is foremost for various mobile applications.\nRecently, geo-indistinguishability and expected inference error are proposed\nfor limiting location leakages. In this paper, we argue that personalization\nmeans regionalization for geo-indistinguishability, and we propose a\nregionalized location obfuscation mechanism called DPIVE with personalized\nutility sensitivities. This substantially corrects the differential and\ndistortion privacy problem of PIVE framework proposed by Yu et al. on NDSS\n2017. We develop DPIVE with two phases. In Phase I, we determine disjoint sets\nby partitioning all possible positions such that different locations in the\nsame set share the Protection Location Set (PLS). In Phase II, we construct a\nprobability distribution matrix in which the rows corresponding to the same PLS\nhave their own sensitivity of utility (PLS diameter). Moreover, by designing\nQK-means algorithm for more search space in 2-D space, we improve DPIVE with\nrefined location partition and present fine-grained personalization, enabling\neach location to have its own privacy level endowed with a customized privacy\nbudget. Experiments with two public datasets demonstrate that our mechanisms\nhave the superior performance, typically on skewed locations."}, {"id": "2102.00685", "title": "The Krein-von Neumann extension revisited", "abstract": "We revisit the Krein-von Neumann extension in the case where the underlying\nsymmetric operator is strictly positive and apply this to derive the explicit\nform of the Krein-von Neumann extension for singular, general (i.e.,\nthree-coefficient) Sturm-Liouville operators on arbitrary intervals. In\nparticular, the boundary conditions for the Krein-von Neumann extension of the\nstrictly positive minimal Sturm-Liouville operator are explicitly expressed in\nterms of generalized boundary values adapted to the (possible) singularity\nstructure of the coefficients near an interval endpoint."}, {"id": "2102.01065", "title": "Do Question Answering Modeling Improvements Hold Across Benchmarks?", "abstract": "Do question answering (QA) modeling improvements (e.g., choice of\narchitecture and training procedure) hold across the diverse landscape of QA\nbenchmarks? To study this question, we introduce the notion of concurrence --\ntwo benchmarks have high concurrence on a set of modeling approaches if they\nrank the modeling approaches similarly. We measure the concurrence between 32\nQA benchmarks on a set of 20 diverse modeling approaches and find that\nhuman-constructed benchmarks have high concurrence amongst themselves, even if\ntheir passage and question distributions are very different. Surprisingly, even\ndownsampled human-constructed benchmarks (i.e., collecting less data) and\nprogrammatically-generated benchmarks (e.g., cloze-formatted examples) have\nhigh concurrence with human-constructed benchmarks. These results indicate\nthat, despite years of intense community focus on a small number of benchmarks,\nthe modeling improvements studied hold broadly."}, {"id": "2102.01162", "title": "Strong rates of convergence of space-time discretization schemes for the\n  2D Navier-Stokes equations with additive noise", "abstract": "We consider the strong solution of the 2D Navier-Stokes equations in a torus\nsubject to an additive noise. We implement a fully implicit time numerical\nscheme and a finite element method in space. We prove that the rate of\nconvergence of the schemes is $\\eta\\in[0,1/2)$ in time and 1 in space. Let us\nmention that the coefficient $\\eta$ is equal to the time regularity of the\nsolution with values in $\\LL^2$. Our method relies on the existence of finite\nexponential moments for both the solution and its time approximation. Our main\nidea is to use a discrete Gronwall lemma for the error estimate without any\nlocalization."}, {"id": "2102.01445", "title": "Prediction of low-keV monochromatic images from polyenergetic CT scans\n  for improved automatic detection of pulmonary embolism", "abstract": "Detector-based spectral computed tomography is a recent dual-energy CT (DECT)\ntechnology that offers the possibility of obtaining spectral information. From\nthis spectral data, different types of images can be derived, amongst others\nvirtual monoenergetic (monoE) images. MonoE images potentially exhibit\ndecreased artifacts, improve contrast, and overall contain lower noise values,\nmaking them ideal candidates for better delineation and thus improved\ndiagnostic accuracy of vascular abnormalities.\n  In this paper, we are training convolutional neural networks~(CNN) that can\nemulate the generation of monoE images from conventional single energy CT\nacquisitions. For this task, we investigate several commonly used\nimage-translation methods. We demonstrate that these methods while creating\nvisually similar outputs, lead to a poorer performance when used for automatic\nclassification of pulmonary embolism (PE). We expand on these methods through\nthe use of a multi-task optimization approach, under which the networks achieve\nimproved classification as well as generation results, as reflected by PSNR and\nSSIM scores. Further, evaluating our proposed framework on a subset of the\nRSNA-PE challenge data set shows that we are able to improve the Area under the\nReceiver Operating Characteristic curve (AuROC) in comparison to a na\\\"ive\nclassification approach from 0.8142 to 0.8420."}, {"id": "2102.01664", "title": "W*-rigidity paradigms for embeddings of II$_1$ factors", "abstract": "We undertake a systematic study of W*-rigidity paradigms for the\nembeddability relation $\\hookrightarrow$ between separable II$_1$ factors and\nits stable version $\\hookrightarrow_s$, obtaining large families of non stably\nisomorphic II$_1$ factors that are mutually embeddable and families of II$_1$\nfactors that are mutually non stably embeddable. We provide an augmentation\nfunctor $G \\mapsto H_G$ from the category of groups into icc groups, so that\n$L(H_{G_1}) \\hookrightarrow_s L(H_{G_2})$ iff $G_1 \\hookrightarrow G_2$. We\nconstruct complete intervals of II$_1$ factors, including a strict chain of\nII$_1$ factors $(M_k)_{k\\in \\mathbb{Z}}$ with the property that if $N$ is any\nII$_1$ factor with $M_i \\hookrightarrow_s N$ and $N \\hookrightarrow_s M_{j}$,\nthen $N \\cong M_k^t$ for some $i \\leq k \\leq j$ and $t > 0$."}, {"id": "2102.01758", "title": "Effective out-of-plane g-factor in strained-Ge/SiGe quantum dots", "abstract": "Recently, lithographic quantum dots in strained-Ge/SiGe have become a\npromising candidate for quantum computation, with a remarkably quick\nprogression from demonstration of a quantum dot to qubit logic demonstrations.\nHere we present a measurement of the out-of-plane $g$-factor for single-hole\nquantum dots in this material. As this is a single-hole measurement, this is\nthe first experimental result that avoids the strong orbital effects present in\nthe out-of-plane configuration. In addition to verifying the expected\n$g$-factor anisotropy between in-plane and out-of-plane magnetic ($B$)-fields,\nvariations in the $g$-factor dependent on the occupation of the quantum dot are\nobserved. These results are in good agreement with calculations of the\n$g$-factor using the heavy- and light-hole spaces of the Luttinger Hamiltonian,\nespecially the first two holes, showing a strong spin-orbit coupling and\nsuggesting dramatic $g$-factor tunability through both the $B$-field and the\ncharge state."}, {"id": "2102.02136", "title": "Efficient application of the Radiance Enhancement method for detection\n  of the forest fires due to combustion-originated reflectance", "abstract": "The existing methods for detection of the cloud scenes are applied at\nrelatively small spectral range within shortwave upwelling radiative wavelength\nflux. We have reported a new method for detection of the cloud scenes based on\nthe Radiance Enhancement (RE). This method can be used to cover a significantly\nwider spectral range from 1100 nm to 1700 nm by using datasets from the\nspace-orbiting micro-spectrometer Argus 1000. Due to high sunlight reflection\nof the smoke originated from the forest or field fires the proposed RE method\ncan also be implemented for detection of combustion aerosols. This approach can\nbe a promising technique for efficient detection and continuous monitor of the\nseasonal forest and field fires. To the best of our knowledge this is the first\nreport showing how a cloud method can be generalized for efficient detection of\nthe forest fires due to combustion-originated reflectance."}, {"id": "2102.02230", "title": "Non-Bloch PT symmetry breaking: Universal threshold and dimensional\n  surprise", "abstract": "In the presence of non-Hermitian skin effect, non-Hermitian lattices\ngenerally have complex-valued eigenenergies under periodic boundary condition,\nbut they can have non-Bloch PT symmetry and therefore completely real\neigenenergies under open boundary condition. This novel PT symmetry and its\nbreaking have been experimentally observed in one dimension. Here, we find that\nnon-Bloch PT symmetry in two and higher dimensions exhibits drastically\ndifferent behaviors compared to its one-dimensional counterpart. Whereas Bloch\nPT breaking and one-dimensional non-Bloch PT breaking generally have nonzero\nthresholds in the large-size limit, the threshold of two and higher-dimensional\nnon-Bloch PT breaking universally approaches zero as the system size increases.\nA product measure, namely the product of bare non-Hermiticity and system size,\nis introduced to quantify the PT breaking tendency. This product being small is\nrequired for the perturbation theory to be valid, thus its growth with system\nsize causes the breakdown of perturbation theory, which underlies the universal\nthreshold. That the universal behaviors emerge only in two and higher\ndimensions indicates an unexpected interplay among PT symmetry, non-Hermitian\nskin effect, and spatial dimensionality. Our predictions can be confirmed on\nexperimentally accessible platforms."}, {"id": "2102.02787", "title": "Liquid demixing in elastic networks: cavitation, permeation, or size\n  selection?", "abstract": "Demixing of multicomponent biomolecular systems via liquid-liquid phase\nseparation (LLPS) has emerged as a potentially unifying mechanism governing the\nformation of several membrane-less intracellular organelles (\"condensates\"),\nboth in the cytoplasm (e.g., stress granules) and in the nucleoplasm (e.g.,\nnucleoli). While both in vivo experiments and studies of synthetic systems\ndemonstrate that LLPS is strongly affected by the presence of a macromolecular\nelastic network, a fundamental understanding of the role of such networks on\nLLPS is still lacking. Here we show that, upon accounting for capillary forces\nresponsible for network expulsion, small-scale heterogeneity of the network,\nand its nonlinear mechanical properties, an intriguing picture of LLPS emerges.\nSpecifically, we predict that, in addition to the experimentally observed\ncavitated droplets which fully exclude the network, two other phases are\nthermodynamically possible: elastically arrested, size-limited droplets at the\nnetwork pore scale, and network-including macroscopic droplets. In particular,\npore size-limited droplets may emerge in chromatin networks, with implications\nfor structure and function of nucleoplasmic condensates."}, {"id": "2102.02949", "title": "Bistability and nonequilibrium condensation in a driven-dissipative\n  Josephson array: a c-field model", "abstract": "Developing theoretical models for nonequilibrium quantum systems poses\nsignificant challenges. Here we develop and study a multimode model of a\ndriven-dissipative Josephson junction chain of atomic Bose-Einstein\ncondensates, as realised in the experiment of Labouvie et al. [Phys. Rev. Lett.\n116, 235302 (2016)]. The model is based on c-field theory, a beyond-mean-field\napproach to Bose-Einstein condensates that incorporates fluctuations due to\nfinite temperature and dissipation. We find the c-field model is capable of\ncapturing all key features of the nonequilibrium phase diagram, including\nbistability and a critical slowing down in the lower branch of the bistable\nregion. Our model is closely related to the so-called Lugiato-Lefever equation,\nand thus establishes new connections between nonequilibrium dynamics of\nultracold atoms with nonlinear optics, exciton-polariton superfluids, and\ndriven damped sine-Gordon systems."}, {"id": "2102.03203", "title": "A Drinfeld type presentation of affine $\\imath$quantum groups II: split\n  BCFG type", "abstract": "Recently, Lu and Wang formulated a Drinfeld type presentation for\n$\\imath$quantum group $\\widetilde{{\\mathbf U}}^\\imath$ arising from quantum\nsymmetric pairs of split affine ADE type. In this paper, we generalize their\nresults by establishing a current presentation for $\\widetilde{{\\mathbf\nU}}^\\imath$ of arbitrary split affine type."}, {"id": "2102.03382", "title": "SkillBot: Identifying Risky Content for Children in Alexa Skills", "abstract": "Many households include children who use voice personal assistants (VPA) such\nas Amazon Alexa. Children benefit from the rich functionalities of VPAs and\nthird-party apps but are also exposed to new risks in the VPA ecosystem. In\nthis paper, we first investigate \"risky\" child-directed voice apps that contain\ninappropriate content or ask for personal information through voice\ninteractions. We build SkillBot - a natural language processing (NLP)-based\nsystem to automatically interact with VPA apps and analyze the resulting\nconversations. We find 28 risky child-directed apps and maintain a growing\ndataset of 31,966 non-overlapping app behaviors collected from 3,434 Alexa\napps. Our findings suggest that although child-directed VPA apps are subject to\nstricter policy requirements and more intensive vetting, children remain\nvulnerable to inappropriate content and privacy violations. We then conduct a\nuser study showing that parents are concerned about the identified risky apps.\nMany parents do not believe that these apps are available and designed for\nfamilies/kids, although these apps are actually published in Amazon's \"Kids\"\nproduct category. We also find that parents often neglect basic precautions\nsuch as enabling parental controls on Alexa devices. Finally, we identify a\nnovel risk in the VPA ecosystem: confounding utterances, or voice commands\nshared by multiple apps that may cause a user to interact with a different app\nthan intended. We identify 4,487 confounding utterances, including 581 shared\nby child-directed and non-child-directed apps. We find that 27% of these\nconfounding utterances prioritize invoking a non-child-directed app over a\nchild-directed app. This indicates that children are at real risk of\naccidentally invoking non-child-directed apps due to confounding utterances."}, {"id": "2102.03432", "title": "Advanced Stationary and Non-Stationary Kernel Designs for Domain-Aware\n  Gaussian Processes", "abstract": "Gaussian process regression is a widely-applied method for function\napproximation and uncertainty quantification. The technique has gained\npopularity recently in the machine learning community due to its robustness and\ninterpretability. The mathematical methods we discuss in this paper are an\nextension of the Gaussian-process framework. We are proposing advanced kernel\ndesigns that only allow for functions with certain desirable characteristics to\nbe elements of the reproducing kernel Hilbert space (RKHS) that underlies all\nkernel methods and serves as the sample space for Gaussian process regression.\nThese desirable characteristics reflect the underlying physics; two obvious\nexamples are symmetry and periodicity constraints. In addition, non-stationary\nkernel designs can be defined in the same framework to yield flexible\nmulti-task Gaussian processes. We will show the impact of advanced kernel\ndesigns on Gaussian processes using several synthetic and two scientific data\nsets. The results show that including domain knowledge, communicated through\nadvanced kernel designs, has a significant impact on the accuracy and relevance\nof the function approximation."}, {"id": "2102.03509", "title": "Robust normalizing flows using Bernstein-type polynomials", "abstract": "Modeling real-world distributions can often be challenging due to sample data\nthat are subjected to perturbations, e.g., instrumentation errors, or added\nrandom noise. Since flow models are typically nonlinear algorithms, they\namplify these initial errors, leading to poor generalizations. This paper\nproposes a framework to construct Normalizing Flows (NF), which demonstrates\nhigher robustness against such initial errors. To this end, we utilize\nBernstein-type polynomials inspired by the optimal stability of the Bernstein\nbasis. Further, compared to the existing NF frameworks, our method provides\ncompelling advantages like theoretical upper bounds for the approximation\nerror, higher interpretability, suitability for compactly supported densities,\nand the ability to employ higher degree polynomials without training\ninstability. We conduct a thorough theoretical analysis and empirically\ndemonstrate the efficacy of the proposed technique using experiments on both\nreal-world and synthetic datasets."}, {"id": "2102.03539", "title": "Sill-Net: Feature Augmentation with Separated Illumination\n  Representation", "abstract": "For visual object recognition tasks, the illumination variations can cause\ndistinct changes in object appearance and thus confuse the deep neural network\nbased recognition models. Especially for some rare illumination conditions,\ncollecting sufficient training samples could be time-consuming and expensive.\nTo solve this problem, in this paper we propose a novel neural network\narchitecture called Separating-Illumination Network (Sill-Net). Sill-Net learns\nto separate illumination features from images, and then during training we\naugment training samples with these separated illumination features in the\nfeature space. Experimental results demonstrate that our approach outperforms\ncurrent state-of-the-art methods in several object classification benchmarks."}, {"id": "2102.03816", "title": "A lower bound on the spectral gap of one-dimensional Schr\\\"odinger\n  operators", "abstract": "In this note we provide an explicit lower bound on the spectral gap of\none-dimensional Schr\\\"odinger operators with non-negative bounded potentials\nand subject to Neumann boundary conditions."}, {"id": "2102.04097", "title": "Effects of Layer Freezing on Transferring a Speech Recognition System to\n  Under-resourced Languages", "abstract": "In this paper, we investigate the effect of layer freezing on the\neffectiveness of model transfer in the area of automatic speech recognition. We\nexperiment with Mozilla's DeepSpeech architecture on German and Swiss German\nspeech datasets and compare the results of either training from scratch vs.\ntransferring a pre-trained model. We compare different layer freezing schemes\nand find that even freezing only one layer already significantly improves\nresults."}, {"id": "2102.04218", "title": "Multiplicity Versus Buchsbaumness of the special fiber cone", "abstract": "Let $(A,\\mathfrak m)$ be a Noetherian local ring of dimension $d>0$ with\ninfinite residue field and $I$ an $\\mathfrak{m}$-primary ideal. Let $\\mathcal\nI$ be an $I$-good filtration. We study an equality of Hilbert coefficients,\nfirst given by Elias and Valla, versus passage of Buchsbaum property from the\nlocal ring to the blow-up algebras. Suppose $e_1(\\mathcal\nI)-e_1(Q)=2e_0(\\mathcal I)-2\\ell(A/I_1)-\\ell(I_1/(I_2+Q))$ where $Q\\subseteq\nI$, a minimal reduction of $\\mathcal I$, is a standard parameter ideal. Under\nsome mild conditions, we prove that if $A$ is Buchsbaum (generalized\nCohen-Macaulay respectively), then the associated graded ring $G(\\mathcal I)$\nis Buchsbaum (generalized Cohen-Macaulay respectively). Our results settle a\nquestion of Corso in general for an $I$-good filtration. Further, let $f_0(I)=\ne_1(I)-e_0(I)-e_1(Q)+\\ell(A/I)+\\mu(I)-d+1$ and\n$e_1(I)-e_1(Q)=2e_0(I)-2\\ell(A/I)-\\ell(I/(I^2+Q))$. We prove, under mild\nconditions, that (1) if $A$ is generalized Cohen-Macaulay, then the special\nfiber ring $F_{\\mathfrak{m}}(I)$ is generalized Cohen-Macaulay; In addition, if\ndepth of $A$ is positive, then depth of $F_{\\mathfrak {m}}(I)$ is same as depth\nof $A$ and (2) if $A$ is Buchsbaum and depth A$\\geq d-1$, then\n$F_{\\mathfrak{m}}(I)$ is Buchsbaum and the $I$-invariant of\n$F_{\\mathfrak{m}}(I)$ is same as that of $A$."}, {"id": "2102.04263", "title": "Generalised correlated batched bandits via the ARC algorithm with\n  application to dynamic pricing", "abstract": "The Asymptotic Randomised Control (ARC) algorithm provides a rigorous\napproximation to the optimal strategy for a wide class of Bayesian bandits,\nwhile retaining low computational complexity. In particular, the ARC approach\nprovides nearly optimal choices even when the payoffs are correlated or more\nthan the reward is observed. The algorithm is guaranteed to asymptotically\noptimise the expected discounted payoff, with error depending on the initial\nuncertainty of the bandit. In this paper, we extend the ARC framework to\nconsider a batched bandit problem where observations arrive from a generalised\nlinear model. In particular, we develop a large sample approximation to allow\ncorrelated and generally distributed observation. We apply this to a classic\ndynamic pricing problem based on a Bayesian hierarchical model and demonstrate\nthat the ARC algorithm outperforms alternative approaches."}, {"id": "2102.04657", "title": "Structure vs. Randomness for Bilinear Maps", "abstract": "We prove that the slice rank of a 3-tensor (a combinatorial notion introduced\nby Tao in the context of the cap-set problem), the analytic rank (a\nFourier-theoretic notion introduced by Gowers and Wolf), and the geometric rank\n(an algebro-geometric notion introduced by Kopparty, Moshkovitz, and Zuiddam)\nare all equal up to an absolute constant. As a corollary, we obtain strong\ntrade-offs on the arithmetic complexity of a biased bilinear map, and on the\nseparation between computing a bilinear map exactly and on average. Our result\nsettles open questions of Haramaty and Shpilka [STOC 2010], and of Lovett\n[Discrete Anal. 2019] for 3-tensors."}, {"id": "2102.04795", "title": "An Improvement for Quantum Tunneling Radiation of Fermions in a\n  Stationary Kerr-Newman Black Hole Spacetime", "abstract": "By introducing a specific etheric-like vector in the Dirac equation with\nLorentz Invariance Violation (LIV) in the curved spacetime, an improved method\nfor quantum tunneling radiation of fermions is proposed. As an example, we\napply this new method to a charged axisymmetric Kerr-Newman black hole.\nFirstly, considering LIV theory, we derive a modified dynamical equation of\nfermion with spin 1/2 in the Kerr-Newman black hole spacetime. Then we solve\nthe equation and find the increase or decrease of black hole's Hawking\ntemperature and entropy are related to constants $a$ and $c$ of the Dirac\nequation with LIV in the curved spacetime. As $c$ is positive, the new Hawking\ntemperature is about $ \\frac{\\sqrt{1+2a+2cmk_r^2}}{\\sqrt{1+2a}}$ times higher\nthan that without modification, but the entropy will decrease. We also make a\nbrief discussion for the case of high spin fermions."}, {"id": "2102.04925", "title": "FedGNN: Federated Graph Neural Network for Privacy-Preserving\n  Recommendation", "abstract": "Graph neural network (GNN) is widely used for recommendation to model\nhigh-order interactions between users and items. Existing GNN-based\nrecommendation methods rely on centralized storage of user-item graphs and\ncentralized model learning. However, user data is privacy-sensitive, and the\ncentralized storage of user-item graphs may arouse privacy concerns and risk.\nIn this paper, we propose a federated framework for privacy-preserving\nGNN-based recommendation, which can collectively train GNN models from\ndecentralized user data and meanwhile exploit high-order user-item interaction\ninformation with privacy well protected. In our method, we locally train GNN\nmodel in each user client based on the user-item graph inferred from the local\nuser-item interaction data. Each client uploads the local gradients of GNN to a\nserver for aggregation, which are further sent to user clients for updating\nlocal GNN models. Since local gradients may contain private information, we\napply local differential privacy techniques to the local gradients to protect\nuser privacy. In addition, in order to protect the items that users have\ninteractions with, we propose to incorporate randomly sampled items as pseudo\ninteracted items for anonymity. To incorporate high-order user-item\ninteractions, we propose a user-item graph expansion method that can find\nneighboring users with co-interacted items and exchange their embeddings for\nexpanding the local user-item graphs in a privacy-preserving way. Extensive\nexperiments on six benchmark datasets validate that our approach can achieve\ncompetitive results with existing centralized GNN-based recommendation methods\nand meanwhile effectively protect user privacy."}, {"id": "2102.05013", "title": "Spherical Message Passing for 3D Molecular Graphs", "abstract": "We consider representation learning of 3D molecular graphs in which each atom\nis associated with a spatial position in 3D. This is an under-explored area of\nresearch, and a principled message passing framework is currently lacking. In\nthis work, we conduct analyses in the spherical coordinate system (SCS) for the\ncomplete identification of 3D graph structures. Based on such observations, we\npropose the spherical message passing (SMP) as a novel and powerful scheme for\n3D molecular learning. SMP dramatically reduces training complexity, enabling\nit to perform efficiently on large-scale molecules. In addition, SMP is capable\nof distinguishing almost all molecular structures, and the uncovered cases may\nnot exist in practice. Based on meaningful physically-based representations of\n3D information, we further propose the SphereNet for 3D molecular learning.\nExperimental results demonstrate that the use of meaningful 3D information in\nSphereNet leads to significant performance improvements in prediction tasks.\nOur results also demonstrate the advantages of SphereNet in terms of\ncapability, efficiency, and scalability. Our code is publicly available as part\nof the DIG library (https://github.com/divelab/DIG)."}, {"id": "2102.05296", "title": "On inhomogeneous extension of Thue-Roth's type inequality with moving\n  targets", "abstract": "Let $\\Gamma\\subset \\overline{\\mathbb Q}^{\\times}$ be a finitely generated\nmultiplicative group of algebraic numbers. Let $\\delta,\n\\beta\\in\\overline{\\mathbb Q}^\\times$ be algebraic numbers with $\\beta$\nirrational. In this paper, we prove that there exist only finitely many triples\n$(u, q, p)\\in\\Gamma\\times\\mathbb{Z}^2$ with $d = [\\mathbb{Q}(u):\\mathbb{Q}]$\nsuch that $$ 0<|\\delta qu+\\beta-p|<\\frac{1}{H^\\varepsilon(u)q^{d+\\varepsilon}},\n$$ where $H(u)$ denotes the absolute Weil height. As an application of this\nresult, we also prove a transcendence result, which states as follows: Let\n$\\alpha>1$ be a real number. Let $\\beta$ be an algebraic irrational and\n$\\lambda$ be a non-zero real algebraic number. For a given real number\n$\\varepsilon >0$, if there are infinitely many natural numbers $n$ for which\n$||\\lambda\\alpha^n+\\beta|| < 2^{- \\varepsilon n}$ holds true, then $\\alpha$ is\ntranscendental, where $||x||$ denotes the distance from its nearest integer.\nWhen $\\alpha$ and $\\beta$ both are algebraic satisfying same conditions, then a\nparticular result of Kulkarni, Mavraki and Nguyen, proved in [3] asserts that\n$\\alpha^d$ is a Pisot number. When $\\beta $ is algebraic irrational, our result\nimplies that no algebraic number $\\alpha$ satisfies the inequality for\ninfinitely many natural numbers $n$. Also, our result strengthens a result of\nWagner and Ziegler [6]. The proof of our results uses the Subspace Theorem\nbased on the idea of Corvaja and Zannier [2] together with various modification\nplay a crucial role in the proof."}, {"id": "2102.05560", "title": "Quantum Spin Liquid with Emergent Chiral Order in the Triangular-lattice\n  Hubbard Model", "abstract": "The interplay between spin frustration and charge fluctuation gives rise to\nan exotic quantum state in the intermediate-interaction regime of the\nhalf-filled triangular-lattice Hubbard model, while the nature of the state is\nunder debate. Using the density matrix renormalization group with\nSU(2)$_{\\rm{spin}} \\otimes $U(1)$_{\\rm{charge}}$ symmetries implemented, we\nstudy the triangular-lattice Hubbard model defined on the long cylinder\ngeometry up to circumference $W=6$. A gapped quantum spin liquid, with on-site\ninteraction $9 \\lesssim U / t \\lesssim 10.75$, is identified between the\nmetallic and the antiferromagnetic Mott insulating phases. In particular, we\nfind that this spin liquid develops a robust long-range spin scalar-chiral\ncorrelation as the system length $L$ increases, which unambiguously unveils the\nspontaneous time-reversal symmetry breaking. In addition, the degeneracy of the\nentanglement spectrum supports symmetry fractionalization and spinon edge modes\nin the obtained ground state. The possible origin of chiral order in this\nintermediate spin liquid and its relation to the rotonlike excitations have\nalso been discussed."}, {"id": "2102.05570", "title": "Identification in the Random Utility Model", "abstract": "The random utility model is known to be unidentified, but there are times\nwhen the model admits a unique representation. We offer two characterizations\nfor the existence of a unique random utility representation. Our first\ncharacterization puts conditions on a graphical representation of the data set.\nNon-uniqueness arises when multiple inflows can be assigned to multiple\noutflows on this graph. Our second characterization provides a direct test for\nuniqueness given a random utility representation. We also show that the support\nof a random utility representation is identified if and only if the\nrepresentation itself is identified."}, {"id": "2102.06028", "title": "Synthesis of Winning Attacks on Communication Protocols using\n  Supervisory Control Theory: Two Case Studies", "abstract": "There is an increasing need to study the vulnerability of communication\nprotocols in distributed systems to malicious attacks that attempt to violate\nproperties such as safety or nonblockingness. In this paper, we propose a\ncommon methodology for formal synthesis of successful attacks against two\nwell-known protocols, the Alternating Bit Protocol (ABP) and the Transmission\nControl Protocol (TCP), where the attacker can always eventually win, called\nFor-all attacks. This generalizes previous work on the synthesis of\nThere-exists attacks for TCP, where the attacker can sometimes win. We model\nthe ABP and TCP protocols and system architecture by finite-state automata and\nemploy the supervisory control theory of discrete event systems to pose and\nsolve the synthesis of For-all attacks, where the attacker has partial\nobservability and controllability of the system events. We consider several\nscenarios of person-in-themiddle attacks against ABP and TCP and present the\nresults of attack synthesis using our methodology for each case."}, {"id": "2102.06396", "title": "Effective bounds on differences of singular moduli that are S-units", "abstract": "Given a singular modulus $j_0$ and a set of rational primes $S$, we study the\nproblem of effectively determining the set of singular moduli $j$ such that\n$j-j_0$ is an $S$-unit. For every $j_0 \\neq 0$, we provide an effective way of\nfinding this set for infinitely many choices of $S$. The same is true if\n$j_0=0$ and we assume the Generalized Riemann Hypothesis. Certain numerical\nexperiments will also lead to the formulation of a \"uniformity conjecture\" for\nsingular $S$-units."}, {"id": "2102.06430", "title": "Topological Thermal Hall Effect of Magnons in Magnetic Skyrmion Lattice", "abstract": "Topological transports of fermions are governed by the Chern numbers of the\nenergy bands lying below the Fermi energy. For bosons, e.g. phonons and magnons\nin a crystal, topological transport is dominated by the Chern number of the\nlowest energy band when the band gap is comparable to the thermal energy. Here,\nwe demonstrate the presence of topological transport by bosonic magnons in a\nlattice of magnetic skyrmions - topological defects formed by a vortex-like\ntexture of spins. We find a distinct thermal Hall signal in the magnetic\nskyrmion phase of an insulating polar magnet GaV4Se8, identified as the\ntopological thermal Hall effect of magnons governed by the Chern number of the\nlowest energy band of the magnons in a triangular lattice of magnetic\nskyrmions. Our findings lay a foundation for studying topological phenomena of\nother bosonic excitations through thermal Hall probe."}, {"id": "2102.06462", "title": "Two Sides of the Same Coin: Heterophily and Oversmoothing in Graph\n  Convolutional Neural Networks", "abstract": "In node classification tasks, heterophily and oversmoothing are two problems\nthat can hurt the performance of graph convolutional neural networks (GCNs).\nThe heterophily problem refers to the model's inability to handle heterophilous\ngraphs where neighboring nodes belong to different classes; the oversmoothing\nproblem refers to the model's degenerated performance with increasing number of\nlayers. These two seemingly unrelated problems have been studied mostly\nindependently, but there is recent empirical evidence that solving one problem\nmay benefit the other. In this work, beyond empirical observations, we aim to:\n(1) analyze the heterophily and oversmoothing problems from a unified\ntheoretical perspective, (2) identify the common causes of the two problems,\nand (3) propose simple yet effective strategies to address the common causes.\nIn our theoretical analysis, we show that the common causes of the heterophily\nand oversmoothing problems--namely, the relative degree of a node and its\nheterophily level--trigger the node representations in consecutive layers to\n\"move\" closer to the original decision boundary, which increases the\nmisclassification rate of node labels under certain constraints. We\ntheoretically show that: (1) Nodes with high heterophily have a higher\nmisclassification rate. (2) Even with low heterophily, degree disparity in a\nnode's neighborhood can influence the movements of node representations and\nresult in a \"pseudo-heterophily\" situation, which helps to explain\noversmoothing. (3) Allowing not only positive but also negative messages during\nmessage passing can help counteract the common causes of the two problems.\nBased on our theoretical insights, we propose simple modifications to the GCN\narchitecture (i.e., learned degree corrections and signed messages), and we\nshow that they alleviate the heteorophily and oversmoothing problems with\nexperiments on 9 networks."}, {"id": "2102.06463", "title": "A more accurate view of the Flat Wall Theorem", "abstract": "We introduce a supporting combinatorial framework for the Flat Wall Theorem.\nIn particular, we suggest two variants of the theorem and we introduce a new,\nmore versatile, concept of wall homogeneity as well as the notion of regularity\nin flat walls. All proposed concepts and results aim at facilitating the use of\nthe irrelevant vertex technique in future algorithmic applications."}, {"id": "2102.06677", "title": "Codifferentials and Quasidifferentials of the Expectation of Nonsmooth\n  Random Integrands and Two-Stage Stochastic Programming", "abstract": "This work is devoted to an analysis of exact penalty functions and optimality\nconditions for nonsmooth two-stage stochastic programming problems. To this\nend, we first study the co-/quasi-differentiability of the expectation of\nnonsmooth random integrands and obtain explicit formulae for its co- and\nquasidifferential under some natural assumptions on the integrand. Then we\nanalyse exact penalty functions for a variational reformulation of two-stage\nstochastic programming problems and obtain sufficient conditions for the global\nexactness of these functions with two different penalty terms. In the end of\nthe paper, we combine our results on the co-/quasi-differentiability of the\nexpectation of nonsmooth random integrands and exact penalty functions to\nderive optimality conditions for nonsmooth two-stage stochastic programming\nproblems in terms of codifferentials."}, {"id": "2102.06700", "title": "On the Paradox of Certified Training", "abstract": "Certified defenses based on convex relaxations are an established technique\nfor training provably robust models. The key component is the choice of\nrelaxation, varying from simple intervals to tight polyhedra.\nCounterintuitively, loose interval-based training often leads to higher\ncertified robustness than what can be achieved with tighter relaxations, which\nis a well-known but poorly understood paradox. While recent works introduced\nvarious improvements aiming to circumvent this issue in practice, the\nfundamental problem of training models with high certified robustness remains\nunsolved. In this work, we investigate the underlying reasons behind the\nparadox and identify two key properties of relaxations, beyond tightness, that\nimpact certified training dynamics: continuity and sensitivity. Our extensive\nexperimental evaluation with a number of popular convex relaxations provides\nstrong evidence that these factors can explain the drop in certified robustness\nobserved for tighter relaxations. We also systematically explore modifications\nof existing relaxations and discover that improving unfavorable properties is\nchallenging, as such attempts often harm other properties, revealing a complex\ntradeoff. Our findings represent an important first step towards understanding\nthe intricate optimization challenges involved in certified training."}, {"id": "2102.07148", "title": "A New Look and Convergence Rate of Federated Multi-Task Learning with\n  Laplacian Regularization", "abstract": "Non-Independent and Identically Distributed (non- IID) data distribution\namong clients is considered as the key factor that degrades the performance of\nfederated learning (FL). Several approaches to handle non-IID data such as\npersonalized FL and federated multi-task learning (FMTL) are of great interest\nto research communities. In this work, first, we formulate the FMTL problem\nusing Laplacian regularization to explicitly leverage the relationships among\nthe models of clients for multi-task learning. Then, we introduce a new view of\nthe FMTL problem, which in the first time shows that the formulated FMTL\nproblem can be used for conventional FL and personalized FL. We also propose\ntwo algorithms FedU and dFedU to solve the formulated FMTL problem in\ncommunication-centralized and decentralized schemes, respectively.\nTheoretically, we prove that the convergence rates of both algorithms achieve\nlinear speedup for strongly convex and sublinear speedup of order 1/2 for\nnonconvex objectives. Experimentally, we show that our algorithms outperform\nthe algorithm FedAvg, FedProx, SCAFFOLD, and AFL in FL settings, MOCHA in FMTL\nsettings, as well as pFedMe and Per-FedAvg in personalized FL settings."}, {"id": "2102.07371", "title": "Flag Hardy space theory on Heisenberg groups and applications", "abstract": "We establish a complete theory of the flag Hardy space on the Heisenberg\ngroup $\\mathbb H^{n}$ with characterisations via atomic decompositions, area\nfunctions, square functions, maximal functions and singular integrals. We\nintroduce several new techniques to overcome the difficulties caused by the\nnoncommutative Heisenberg group multiplication, and the lack of a suitable\nFourier transformation and Cauchy--Riemann type equations. Applications include\nthe boundedness from the flag Hardy space to $L^1(\\mathbb H^n)$ of various\nsingular integral operators that arise in complex analysis, a sharp boundedness\nresult on the flag Hardy space of the Marcinkiewicz-type multipliers introduced\nby M\\\"uller, Ricci and Stein, and the decomposition of flag BMO space via\nsingular integrals."}, {"id": "2102.07377", "title": "Anomalous dimensions of monopole operators in scalar QED$_3$ with\n  Chern-Simons term", "abstract": "We study monopole operators with the lowest possible topological charge\n$q=1/2$ at the infrared fixed point of scalar electrodynamics in $2+1$\ndimension (scalar QED$_3$) with $N$ complex scalars and Chern-Simons coupling\n$|k|=N$. In the large $N$ expansion, monopole operators in this theory with\nspins $\\ell<O(\\sqrt{N})$ and associated flavor representations are expected to\nhave the same scaling dimension to sub-leading order in $1/N$. We use the\nstate-operator correspondence to calculate the scaling dimension to sub-leading\norder with the result $N-0.2789+O(1/N)$, which improves on existing leading\norder results. We also compute the $\\ell^2/N$ term that breaks the degeneracy\nto sub-leading order for monopoles with spins $\\ell=O(\\sqrt{N})$."}, {"id": "2102.07567", "title": "Learning Accurate Decision Trees with Bandit Feedback via Quantized\n  Gradient Descent", "abstract": "Decision trees provide a rich family of highly non-linear but efficient\nmodels, due to which they continue to be the go-to family of predictive models\nby practitioners across domains. But learning trees is challenging due to their\ndiscrete decision boundaries. The state-of-the-art (SOTA) techniques resort to\n(a) learning \\textit{soft} trees thereby losing logarithmic inference time; or\n(b) using methods tailored to specific supervised learning settings, requiring\naccess to labeled examples and loss function. In this work, by leveraging\ntechniques like overparameterization and straight-through estimators, we\npropose a unified method that enables accurate end-to-end gradient based tree\ntraining and can be deployed in a variety of settings like offline supervised\nlearning and online learning with bandit feedback. Using extensive validation\non standard benchmarks, we demonstrate that our method provides best of both\nworlds, i.e., it is competitive to, and in some cases more accurate than\nmethods designed \\textit{specifically} for the supervised settings; and in\nbandit settings, where most existing tree learning techniques are not\napplicable, our models are still accurate and significantly outperform the\napplicable SOTA methods."}, {"id": "2102.07622", "title": "Depth lower bounds in Stabbing Planes for combinatorial principles", "abstract": "Stabbing Planes (also known as Branch and Cut) is a proof system introduced\nvery recently which, informally speaking, extends the DPLL method by branching\non integer linear inequalities instead of single variables. The techniques\nknown so far to prove size and depth lower bounds for Stabbing Planes are\ngeneralizations of those used for the Cutting Planes proof system established\nvia communication complexity arguments. As such they work for the lifted\nversion of combinatorial statements. Rank lower bounds for Cutting Planes are\nalso obtained by geometric arguments called protection lemmas.\n  In this work we introduce two new geometric approaches to prove size/depth\nlower bounds in Stabbing Planes working for any formula: (1) the antichain\nmethod, relying on Sperner's Theorem and (2) the covering method which uses\nresults on essential coverings of the boolean cube by linear polynomials, which\nin turn relies on Alon's combinatorial Nullenstellensatz.\n  We demonstrate their use on classes of combinatorial principles such as the\nPigeonhole principle, the Tseitin contradictions and the Linear Ordering\nPrinciple. By the first method we prove almost linear size lower bounds and\noptimal logarithmic depth lower bounds for the Pigeonhole principle and\nanalogous lower bounds for the Tseitin contradictions over the complete graph\nand for the Linear Ordering Principle. By the covering method we obtain a\nsuperlinear size lower bound and a logarithmic depth lower bound for Stabbing\nPlanes proof of Tseitin contradictions over a grid graph."}, {"id": "2102.07646", "title": "COVID-19 Heterogeneity in Islands Chain Environment", "abstract": "As 2021 dawns, the COVID-19 pandemic is still raging strongly as vaccines\nfinally appear and hopes for a return to normalcy start to materialize. There\nis much to be learned from the pandemic's first year data that will likely\nremain applicable to future epidemics and possible pandemics. With only minor\nvariants in virus strain, countries across the globe have suffered roughly the\nsame pandemic by first glance, yet few locations exhibit the same patterns of\nviral spread, growth, and control as the state of Hawai'i. In this paper, we\nexamine the data and compare the COVID-19 spread statistics between the\ncounties of Hawai'i as well as examine several locations with similar\nproperties to Hawai'i."}, {"id": "2102.07684", "title": "Fair and Optimal Cohort Selection for Linear Utilities", "abstract": "The rise of algorithmic decision-making has created an explosion of research\naround the fairness of those algorithms. While there are many compelling\nnotions of individual fairness, beginning with the work of Dwork et al., these\nnotions typically do not satisfy desirable composition properties. To this end,\nDwork and Ilvento introduced the fair cohort selection problem, which captures\na specific application where a single fair classifier is composed with itself\nto pick a group of candidates of size exactly $k$. In this work we introduce a\nspecific instance of cohort selection where the goal is to choose a cohort\nmaximizing a linear utility function. We give approximately optimal\npolynomial-time algorithms for this problem in both an offline setting where\nthe entire fair classifier is given at once, or an online setting where\ncandidates arrive one at a time and are classified as they arrive."}, {"id": "2102.07699", "title": "Anti-concentration of random variables from zero-free regions", "abstract": "This paper provides a connection between the concentration of a random\nvariable and the distribution of the roots of its probability generating\nfunction. Let $X$ be a random variable taking values in $\\{0,\\ldots,n\\}$ with\n$\\mathbb{P}(X = 0)\\mathbb{P}(X = n) > 0$ and with probability generating\nfunction $f_X$. We show that if all of the zeros $\\zeta$ of $f_X$ satisfy\n$|\\arg(\\zeta)| \\geq \\delta$ and $R^{-1} \\leq |\\zeta| \\leq R$ then \\[\n\\operatorname{Var}(X) \\geq c R^{-2\\pi/\\delta}n, \\] where $c > 0$ is a absolute\nconstant. We show that this result is sharp, up to the factor $2$ in the\nexponent of $R$. As a consequence, we are able to deduce a Littlewood--Offord\ntype theorem for random variables that are not necessarily sums of i.i.d.\\\nrandom variables."}, {"id": "2102.07758", "title": "Decentralized Distributed Optimization for Saddle Point Problems", "abstract": "We consider distributed convex-concave saddle point problems over arbitrary\nconnected undirected networks and propose a decentralized distributed algorithm\nfor their solution. The local functions distributed across the nodes are\nassumed to have global and local groups of variables. For the proposed\nalgorithm we prove non-asymptotic convergence rate estimates with explicit\ndependence on the network characteristics. To supplement the convergence rate\nanalysis, we propose lower bounds for strongly-convex-strongly-concave and\nconvex-concave saddle-point problems over arbitrary connected undirected\nnetworks. We illustrate the considered problem setting by a particular\napplication to distributed calculation of non-regularized Wasserstein\nbarycenters."}, {"id": "2102.07981", "title": "SiMaN: Sign-to-Magnitude Network Binarization", "abstract": "Binary neural networks (BNNs) have attracted broad research interest due to\ntheir efficient storage and computational ability. Nevertheless, a significant\nchallenge of BNNs lies in handling discrete constraints while ensuring bit\nentropy maximization, which typically makes their weight optimization very\ndifficult. Existing methods relax the learning using the sign function, which\nsimply encodes positive weights into +1s, and -1s otherwise. Alternatively, we\nformulate an angle alignment objective to constrain the weight binarization to\n{0,+1} to solve the challenge. In this paper, we show that our weight\nbinarization provides an analytical solution by encoding high-magnitude weights\ninto +1s, and 0s otherwise. Therefore, a high-quality discrete solution is\nestablished in a computationally efficient manner without the sign function. We\nprove that the learned weights of binarized networks roughly follow a Laplacian\ndistribution that does not allow entropy maximization, and further demonstrate\nthat it can be effectively solved by simply removing the $\\ell_2$\nregularization during network training. Our method, dubbed sign-to-magnitude\nnetwork binarization (SiMaN), is evaluated on CIFAR-10 and ImageNet,\ndemonstrating its superiority over the sign-based state-of-the-arts. Our source\ncode, experimental settings, training logs and binary models are available at\nhttps://github.com/lmbxmu/SiMaN."}, {"id": "2102.08127", "title": "Learning curves of generic features maps for realistic datasets with a\n  teacher-student model", "abstract": "Teacher-student models provide a framework in which the typical-case\nperformance of high-dimensional supervised learning can be described in closed\nform. The assumptions of Gaussian i.i.d. input data underlying the canonical\nteacher-student model may, however, be perceived as too restrictive to capture\nthe behaviour of realistic data sets. In this paper, we introduce a Gaussian\ncovariate generalisation of the model where the teacher and student can act on\ndifferent spaces, generated with fixed, but generic feature maps. While still\nsolvable in a closed form, this generalization is able to capture the learning\ncurves for a broad range of realistic data sets, thus redeeming the potential\nof the teacher-student framework. Our contribution is then two-fold: First, we\nprove a rigorous formula for the asymptotic training loss and generalisation\nerror. Second, we present a number of situations where the learning curve of\nthe model captures the one of a realistic data set learned with kernel\nregression and classification, with out-of-the-box feature maps such as random\nprojections or scattering transforms, or with pre-learned ones - such as the\nfeatures learned by training multi-layer neural networks. We discuss both the\npower and the limitations of the framework."}]