[{"id": "https://pubmed.ncbi.nlm.nih.gov/24675898", "title": "MicroRNA-424 Is Down-Regulated in Hepatocellular Carcinoma and Suppresses Cell Migration and Invasion through c-Myb", "abstract": "Hepatocellular carcinoma (HCC) is one of the leading causes of cancer-related mortality worldwide. MicroRNAs (miRNAs) are important regulators of multiple cellular processes, and the aberrant miRNAs expressions have been observed in different types of cancer including HCC. Their pathysiologic role and their relevance to tumorigenesis are still largely unknown. In this study, we demonstrated the down-regulation of miR-424 in HCC cell lines and tissues by quantitative RT-PCR analyses. Overexpression of miR-424 reduced the HCC cell prolifetation, migration, and invasion. Conversely, inhibiton of miR-424 expression significantly accelerated the cell proliferation, migration, and invasion. In addition, we further identified c-Myb as a functional downstream target of miR-424 by directly targeting the 3'UTR of c-Myb. Furthermore, overexpression of c-Myb impaired miR-424-induced inhibition of proliferation and invasion in HCC cells. Our results demonstrated that miR-424 was involved in tumorigenesis of HCC at least in part by suppression of c-Myb.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/25136862", "title": "MicroRNA-410 Suppresses Migration and Invasion by Targeting MDM2 in Gastric Cancer", "abstract": "Gastric cancer is one of the most frequent malignancies in tumors in the East Asian countries. Identifying precise prognostic markers and effective therapeutic targets is important in the treatment of gastric cancer. microRNAs (miRNAs) play important roles in tumorigenesis. However, the mechanisms by which miRNAs regulate gastric cancer metastasis remain poorly understood. In this study, we found that the levels of miR-410 in gastric cancer and cell lines were much lower than that in the normal control, respectively, and the lower level of miR-410 was significantly associated with lymph-node metastasis. Transfection of miR-410 mimics could significantly inhibit the cell proliferation, migration and invasion in the HGC-27 gastric cancer cell lines. In contrast, knockdown of miR-410 had the opposite effect on the cell proliferation, migration and invasion. Moreover, we also found that MDM2 was negatively regulated by miR-410 at the post-transcriptional level, via a specific target site with the 3'UTR by luciferase reporter assay. The expression of MDM2 was inversely correlated with miR-410 expression in gastric cancer tissues, and overexpression of MDM2 in miR-410-transfected gastric cancer cells effectively rescued the inhibition of cell proliferation and invasion caused by miR-410. Thus, our findings suggested that miR-410 acted as a new tumor suppressor by targeting the MDM2 gene and inhibiting gastric cancer cells proliferation, migration and invasion. The findings of this study contributed to the current understanding of these functions of miR-410 in gastric cancer.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/25289936", "title": "MicroRNA-217 Regulates WASF3 Expression and Suppresses Tumor Growth and Metastasis in Osteosarcoma", "abstract": "Osteosarcoma is the most common type of primary tumor of bone which mainly affects adolescents and young adults. Osteosarcoma causes large number of deaths because of its complex pathogenesis and resistance to conventional treatment. MicroRNAs are a class of small noncoding RNAs that function as critical gene regulators through targeting mRNAs, causing translational repression or degradation. In this study, we showed that miR-217 was down-regulated in osteosarcoma cell lines and tissues in comparison to that in normal bone cells or tissues. Meanwhile, the lower level of miR-217 was associated with metastasis in clinical osteosarcoma patients. Furthermore, we found that overexpession of miR-217 markedly suppressed cell proliferation, migration, and invasion of osteosarcoma cells. Conversely, the inhibition of miR-217 expression significantly accelerated the cell proliferation, migration, and invasion. Moreover, we identified WASF3 as a novel functional downstream target of miR-217. The ectopic expression of WASF3 can partially reverse the inhibition of cell proliferation and invasion caused by miR-217. Take together, our results demonstrate that miR-217 functions as a tumor-suppressive miRNA and inhibits the osteosarcoma tumorigenesis through targeting WASF3.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/25330156", "title": "MicroRNA-137 Upregulation Increases Bladder Cancer Cell Proliferation and Invasion by Targeting PAQR3", "abstract": "There is increasing evidence suggesting that dysregulation of some microRNAs (miRNAs) may contribute to tumor progression and metastasis and have been proposed to be key regulators of diverse biological processes such as transcriptional regulation, cell growth and tumorigenesis. Previous studies have shown that miR-137 is dysregulated in some malignancies, but its role in bladder cancer is still unknown. In our study, we find that miR-137 is up-regulated in human bladder cancer tissues and cell lines. Moreover, the higher level of miR-137 was associated with pM or pTNM stage in clinical bladder cancer patients. Enforced expression of miR-137 in bladder cancer cells significantly enhanced their proliferation, migration and invasion. Bioinformatics analysis identified the tumor suppressor gene PAQR3 as a potential miR-137 target gene. Further studies indicated that miR-137 suppressed the expression of PAQR3 by binding to its 3'-untranslated region. Silencing of PAQR3 by small interfering RNAs phenocopied the effects of miR-137 overexpression, whereas restoration of PAQR3 in bladder cancer cells bladder cancer cells overexpressing miR-137, partially reversed the suppressive effects of miR-137. These findings indicate that miR-137 could be a potential oncogene in bladder cancer.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/25536034", "title": "MicroRNA-503 Acts as a Tumor Suppressor in Osteosarcoma by Targeting L1CAM", "abstract": "Deregulated microRNAs and their roles in tumorigenesis have attracted much attention in recent years. Although miR-503 was shown to be important in tumorigenesis, its role in osteosarcoma remains unknown. In this study, we focused on the expression and mechanisms of miR-503 in osteosarcoma development. We found that miR-503 was down-regulated in osteosarcoma cell lines and primary tumor samples, and the restoration of miR-503 reduced cell proliferation, migration and invasion. Low level of miR-503 in patients with osteosarcoma was associated with considerably shortened disease-free survival. Furthermore, bioinformatic prediction and experimental validation revealed that the anti-tumor effect of miR-503 was probably exerted through targeting and repressing of L1CAM expression. L1CAM was up-regulated in osteosarcoma cell lines and primary tumor samples and the expression level of L1CAM were negatively correlated with miR-503 levels in osteosarcoma tissues. Collectively, our data identify the important roles of miR-503 in osteosarcoma pathogenesis, indicating its potential application in cancer therapy.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/25546234", "title": "MicroRNA-33b Suppresses Migration and Invasion by Targeting c-Myc in Osteosarcoma Cells", "abstract": "MicroRNAs have emerged as fundamental regulators in gene expression through silencing gene expression at the post-transcriptional and translational levels. Osteosarcoma is the most common type of primary malignant bone tumor and is characterized by complex genetic changes and resistance to conventional treatments. In our study, the role of miR-33b in the progression and metastasis of osteosarcoma was investigated. Our results showed that miR-33b was significantly downregulated in osteosarcoma tissue and cell lines. Overexpression of miR-33b significantly inhibited cell proliferation, migration, and invasion in the MG-63 osteosarcoma cell line. Moreover, we also showed that c-Myc was negatively regulated by miR-33b at the posttranscriptional level, via a specific target site within the 3'UTR. Overexpression of c-Myc impaired miR-33b-induced inhibition of proliferation and invasion in osteosarcoma cells. The expression of c-Myc was frequently downregulated in osteosarcoma tumors and cell lines and was inversely correlated with miR-33b expression. Thus, our findings suggest that miR-33b inhibits osteosarcoma cells migration and invasion by targeting the c-Myc gene, acting as tumor suppressor. The findings of this study contribute to current understanding of the functions of miR-33b in osteosarcoma.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/25728273", "title": "MicroRNA-575 targets BLID to promote growth and invasion of non-small cell lung cancer cells", "abstract": "This study was designed to detect miR-575 expression and function in non-small cell lung cancer (NSCLC). A higher expression of miR-575 in NSCLC tissues was observed compared with adjacent non-neoplastic tissues. Furthermore, re-introduction of miR-575 significantly promoted cell proliferation, migration, and invasion in the NSCLC line. Moreover, we showed that BLID is negatively regulated by miR-575 at the posttranscriptional level, via a specific target site within the 3'UTR. Overexpression of BLID counteracted miR-575-induced proliferation and invasion in NSCLC cells. The expression of BLID is frequently downregulated in NSCLC tumors and cell lines and inversely correlates with miR-575 expression. The findings of this study contribute to the current understanding of the functions of miR-575 in NSCLC.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/25739101", "title": "MicroRNA-377 Suppresses Cell Proliferation and Invasion by Inhibiting TIAM1 Expression in Hepatocellular Carcinoma", "abstract": "Increasing evidence has suggested that microRNAs (miRNAs) play an important role in the initiation and progression of hepatocellular carcinoma (HCC). Here, we identified a novel tumor suppressive miRNA, miR-377, and investigated its role in HCC. The expression of miR-377 in HCC tissues and cell lines was detected by real-time reverse-transcription PCR. The effects of miR-377 on HCC cell proliferation and invasion were also investigated. Western blot and luciferase reporter assay were used to identify the direct and functional target of miR-377. The expression of miR-377 was markedly downregulated in human HCC tissues and cell lines. MiR-377 can dramatically inhibit cell growth and invasion in HCC cells. Subsequent investigation revealed that T lymphoma invasion and metastasis 1 (TIAM1) was a direct and functional target of miR-377 in HCC cells. Overexpression of miR-377 impaired TIAM1-induced promotion of proliferation and invasion in HCC cells. Finally, miR-377 is inversely correlated with TIAM1 expression in human HCC tissues. These findings reveal that miR-377 functions as a tumor suppressor and inhibits the proliferation and invasion of HCC cells by targeting TIAM1, which may consequently serve as a therapeutic target for HCC patients.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/25728273", "title": "MicroRNA-575 targets BLID to promote growth and invasion of non-small cell lung cancer cells", "abstract": "This study was designed to detect miR-575 expression and function in non-small cell lung cancer (NSCLC). A higher expression of miR-575 in NSCLC tissues was observed compared with adjacent non-neoplastic tissues. Furthermore, re-introduction of miR-575 significantly promoted cell proliferation, migration, and invasion in the NSCLC line. Moreover, we showed that BLID is negatively regulated by miR-575 at the posttranscriptional level, via a specific target site within the 3'UTR. Overexpression of BLID counteracted miR-575-induced proliferation and invasion in NSCLC cells. The expression of BLID is frequently downregulated in NSCLC tumors and cell lines and inversely correlates with miR-575 expression. The findings of this study contribute to the current understanding of the functions of miR-575 in NSCLC.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/25739101", "title": "MicroRNA-377 Suppresses Cell Proliferation and Invasion by Inhibiting TIAM1 Expression in Hepatocellular Carcinoma", "abstract": "Increasing evidence has suggested that microRNAs (miRNAs) play an important role in the initiation and progression of hepatocellular carcinoma (HCC). Here, we identified a novel tumor suppressive miRNA, miR-377, and investigated its role in HCC. The expression of miR-377 in HCC tissues and cell lines was detected by real-time reverse-transcription PCR. The effects of miR-377 on HCC cell proliferation and invasion were also investigated. Western blot and luciferase reporter assay were used to identify the direct and functional target of miR-377. The expression of miR-377 was markedly downregulated in human HCC tissues and cell lines. MiR-377 can dramatically inhibit cell growth and invasion in HCC cells. Subsequent investigation revealed that T lymphoma invasion and metastasis 1 (TIAM1) was a direct and functional target of miR-377 in HCC cells. Overexpression of miR-377 impaired TIAM1-induced promotion of proliferation and invasion in HCC cells. Finally, miR-377 is inversely correlated with TIAM1 expression in human HCC tissues. These findings reveal that miR-377 functions as a tumor suppressor and inhibits the proliferation and invasion of HCC cells by targeting TIAM1, which may consequently serve as a therapeutic target for HCC patients.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/25793604", "title": "MicroRNA-153 Inhibits Osteosarcoma Cells Proliferation and Invasion by Targeting TGF-β2", "abstract": "Increasing evidence indicates that microRNAs (miRNAs), a class of small noncoding RNAs, participate in almost every step of cellular processes. MiRNAs are aberrantly expressed in human cancers and contribute to cancer development and progression. Study of miRNAs may provide a new clue for understanding the mechanism of carcinogenesis and a new tool for cancer treatment. In the present study, miR-153 was downregulated in human osteosarcoma tissues and cell lines. Introduction of miR-153 mimics into the MG-63 cells inhibited cell proliferation and invasion. Our results further revealed that transforming growth factor beta 2 (TGF-β2) was negatively regulated by miR-153. Furthermore, overexpression of miR-153 decreased p-SMAD2, p-SMAD3, epidermal growth factor receptor (EGFR) and insulin-like growth factor binding protein-3 (IGFBP-3) expressions, which were the downstream signaling molecules of TGF-β. Furthermore, miRNA-153 suppressed TGF-β-mediated MG-63 proliferation and migration. Therefore, our results suggest that miR-153 may act as a tumor suppressor in osteosarcoma through targeting TGF-β2.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/25856555", "title": "MiR-506 Suppresses Tumor Proliferation and Invasion by Targeting FOXQ1 in Nasopharyngeal Carcinoma", "abstract": "MiRNAs are small noncoding RNAs that play important roles in various biological processes including tumorigenesis. However, little is known about the expression and function of miR-506 in nasopharyngeal carcinoma (NPC). In this study, we showed that miR-506 was downregulated in nasopharyngeal carcinoma (NPC) cell lines and tissues. Ectopic expression of miR-506 dramatically suppressed cell proliferation, colony formation and invasion. Moreover, we identified the Forkhead box Q1 (FOXQ1) gene as a novel direct target of miR-506. MiR-506 exerts its tumor suppressor function through inhibition of the FOXQ1, which was involved in tumor metastasis and proliferation in various cancers. Furthermore, the expression of FOXQ1 is up-regulated in NPC cell lines and tissues. Taken together, our results indicate that miR-506 functions as a tumor suppressor miRNA in NPC and that its suppressive effects are mediated chiefly by repressing FOXQ1 expression.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/26617713", "title": "Anticancer activity of NOB1-targeted shRNA combination with TRAIL in epithelial ovarian cancer cells.", "abstract": "Tumor necrosis factor-related apoptosis-inducing ligand (TRAIL) based strategy is a promising targeted therapeutic approach for the treatment of ovarian cancer. However, the effectiveness of the treatment remains limited due to the inherent or acquired resistance of tumor cells to TRAIL. Our previously study demonstrated that downregulation of NOB1 (NIN1/RPN12 binding protein 1 homolog) expression by a lentiviral short hairpin RNA (shRNA) delivery system (Lv/sh-NOB1) suppressed ovarian cancer growth. Here, Lv/sh-NOB1 and TRAIL were combined and tested the effects of this combination on ovarian cancer cells to identify more effective therapeutics against ovarian cancer by several in vitro experiments. Tumor growth ability in SKVO3 xenograft nude mice was also determined to define this combination treatment effect in tumorigenesis in vivo. In vitro assay showed that Lv/sh-NOB1 in combination with TRAIL treatment in ovarian cancer cell synergistically suppressed the proliferation and colony formation, as well as induced cell apoptosis and increased the activity of caspase-3, -8 and -9. In vivo assay showed that Lv/sh-NOB1 combination with TRAIL synergistically suppressed tumor growth of nude mice model. Importantly, we found that downregulation of NOB1 could upregulate DR5 expression and active MAPK pathway, which might contribute to increase sensitivity TRAIL to ovarian cancer cells. These findings suggested that Lv/sh-NOB1 combination with TRAIL treatment may be a potential treatment approach for ovarian cancer.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/26695144", "title": "miR-494 suppresses tumor growth of epithelial ovarian carcinoma by targeting IGF1R", "abstract": "A growing body of evidence suggests that microRNA-494 (miR-494) could act as tumor-suppressive or oncogenic microRNAs (miRNAs) in different types of tumors. However, the biological roles and underlying mechanisms of miR-494 remain unknown in human epithelial ovarian carcinoma (EOC). Therefore, the aims of this study were to investigate the miR-494 expression and the significance of its clinical diagnosis in patients suffering EOC and to analyze its role and underlying molecular mechanism on the carcinogenesis of EOC. Here, we found that miR-494 was significantly decreased in EOC cell lines and tissues and its expression was negatively correlated with advanced International Federation of Gynecology and Obstetrics (FIGO) stage, high pathological grade, and lymph node metastasis (all P < 0.01). Functional studies showed that overexpression of miR-494 in EOC cells could remarkably inhibit proliferation, colony formation, migration, and invasion and induce cell apoptosis, G0/G1 phase arrest. An in vivo analysis revealed that the overexpression of miR-494 suppressed tumor growth in a nude mouse xenograft model system. Bioinformatic assay and dual-luciferase assay confirmed that insulin-like growth factor 1 receptor (IGF1R) was as a direct target of miR-494 in EOC cells. Western blot assay showed that overexpression of miR-494 inhibited IGF1R expression and its downstream signal protein expression. In addition, downregulation of IGF1R has similar effects with miR-494 overexpression on EOC cells and overexpression of IGF1R effectively rescued the inhibition of overexpressed miR-494 in EOC cells. These data suggested that miR-494 functions as a tumor suppressor in EOC by targeting IGF1R.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/28337275", "title": "MicroRNA-215 targets NOB1 and inhibits growth and invasion of epithelial ovarian cancer.", "abstract": "MicroRNA-215 (miR-215) has been showed to play crucial roles in tumorigenesis and tumor progression in many types of cancer. However, its biological function and underlying mechanism in epithelial ovarian cancer (EOC) remains greatly unknown. The aims of this study were to investigate biological role and underlying mechanism of miR-215 in EOC. Here, we found that miR-215 expression was significantly decreased in EOC tissues or cell lines compared with adjacent normal tissues or normal ovarian cell line. Decreased miR-215 expression was significantly associated with International Federation of Gynaecology and Obstetrics (FIGO) stage and lymph node metastasis. Function analysis revealed that overexpression of miR-215 using miR-215 mimic significantly inhibit EOC cell proliferation, colony formation, migration and invasion in vitro. as well as suppress tumor growth in vivo. Moreover, we identified ribosome assembly factor NIN/RPN12 binding protein (NOB1) as a direct targets for miR-215 binding, resulting in suppression it expression, which in turn activated the MAPK signaling pathway. In clinical EOC specimens, NOB1 expression was upregulated, and inversely correlated with miR-215 expression (r = -0.675, P<0.001). Overexpression of NOB1 effectively rescued inhibition effect on EOC cells by induced miR-215 overexpression. Taken together, our findings suggested that miR-215 suppressed EOC growth and invasion by targeting NOB1.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/29207663", "title": "MicroRNA-218 inhibits proliferation and invasion in ovarian cancer by targeting Runx2", "abstract": "MicroRNA-218 (miR-218) has been implicated in the development and progression of multiple cancers. We investigated the role of miR-218 in ovarian cancer progression. We found that miR-218 expression levels were lower in ovarian cancer tissues and cell lines than in adjacent normal tissues or a normal ovarian cell line.miR-218 levels associated with International Federation of Gynecology and Obstetrics (FIGO) stage and lymph node metastasis. Exogenous expression of miR-218 inhibited cell proliferation, colony formation, migration, and invasion in vitro and suppressed tumor growth in a tumor-bearing nude mouse model. Runt-related transcription factor 2 (RUNX2) was identified as a direct functional target of miR-218, and its expression was inversely correlated with miR-218 expression in ovarian cancer tissues. RUNX2 overexpression rescued the suppressive effect of miR-218 on ovarian cancer cell proliferation, colony formation, migration, and invasion. These findings highlight an important role played bymiR-218 in the regulation of cancer growth and metastasis, in part by repressing RUNX2, and revealed the potential of miR-218 as a new therapeutic target inovarian cancer.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/28560060", "title": "MicroRNA-365 inhibits ovarian cancer progression by targeting Wnt5a.", "abstract": "MicroRNA-365 (miR-365) has been reported to play an important role in tumorigenesis in many types of cancers; however, the role of miR-365 in the carcinogenesis of ovarian cancer remains unknown. In this study, we focused on the roles and underlying mechanisms of miR-365 in ovarian cancer. Here, we found that miR-365 expression level was significantly decreased in ovarian cancer tissues and cell lines, and that low miR-365 expression was negatively significantly associated with advanced stages as defined by the International Federation of Gynecology and Obstetrics (FIGO), histological grading, and lymph node metastasis. Further functional assays showed that transfection with a miR-365 mimic significantly decreased ovarian cancer cell proliferation, colony formation, migration, and invasion. In addition, Wnt5a was identified as a target gene of miR-365 in ovarian cancer by bioinformatic analysis, luciferase reporter assay, qPCR, and western blot. Wnt5a expression levels were upregulated and inversely correlated with miR-365 expression in ovarian cancer tissues (r = -0.638, P < 0.0001). Overexpression of Wnt5a could effectively reverse the miR-365 overexpression-induced suppression of proliferation and invasion in ovarian cancer cells. Additionally, in vivo studies utilizing a xenograft model demonstrated that overexpression of miR-365 could reduce tumor growth by repressing Wnt5a. Taken together, these findings suggest that miR-365 may be a promising candidate for therapeutic application in ovarian cancer treatment.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/28849036", "title": "Knockdown of AQP1 inhibits growth and invasion of human ovarian cancer cells", "abstract": "Aquaporin 1 (AQP1), which is a water channel protein, has been demonstrated to have an important role in cell proliferation and migration of various cancers. However, its specific role in ovarian cancer remains to be elucidated. The present study demonstrated that AQP1 expression was elevated in the majority of patients with ovarian cancer compared with normal ovarian tissues. In addition, a short interfering (si)RNA targeting AQP1 was established, and transfected into the SKOV3 ovarian cancer cell line, to investigate the effects on cell viability, apoptosis, migration and invasion in the ovarian cancer cells using an MTT assay, flow cytometry, wound healing and Transwell invasion chamber assays, respectively. The results of the present study demonstrated that siRNA targeting AQP1 effectively downregulated AQP1 expression at the mRNA and protein levels, markedly suppressed cell viability, migration and invasion and promoted apoptosis of ovarian cancers cells. These results suggested that AQP1 may serve as a novel target for ovarian cancer treatment in the future.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/30372802", "title": "RETRACTED: Long non-coding RNA LINC00460 promotes epithelial ovarian cancer progression by regulating microRNA-338-3p", "abstract": "The long non-coding RNA LINC00460 was reported to be involved in the regulation of the malignant phenotype of multiple cancers, and to be a novel diagnostic and therapeutic target. However, its function and mechanisms of action have not yet been fully elucidated in epithelial ovarian cancer (EOC). The aims of this study were to investigate the biological function and underlying mechanism of LINC00460 in EOC progression.LINC00460 expression was measured in EOC tissues and paired adjacent tissues obtained from 98 patients with EOC by quantitative real time PCR (qRT-PCR). The effect of LINC00460 on cell proliferation, apoptosis, migration and invasion was analyzed by CCK8 assay, flow cytometry, wound healing assay, and Matrigel invasion assay, respectively. Targeting miRNAs of LINC00460 in EOC cells was determined by luciferase reporter assay and qRT-PCR. Protein expression was measured by western blot analysis.LINC00460 expression was upregulated in EOC tissues compared with that in paired adjacent tissues, and higher LINC00460 levels were correlated with advanced International Federation of Gynecology and Obstetrics (FIGO) stage, lymph node metastasis, and shorter overall survival in EOC patients. Knockdown of LINC00460 significantly suppressed cell proliferation, migration, and invasion, and induced apoptosis in EOC cells. A rescue experiment and luciferase reporter assay showed that LINC00460 exerted its oncogenic functions in EOC, at least in part, through binding miR-338-3p.LINC00460 may play a crucial role in EOC progression, and may be a promising therapeutic strategy against EOC.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/24931370", "title": "miR-96 /HBP1/Wnt/β-catenin regulatory circuitry promotes glioma growth", "abstract": "We found that miR-96 is overexpressed in glioma, and its level inversely correlates with the survival of patients. The reduction in miR-96 abundance suppresses the proliferation and colony formation of glioma cells. The tumorigenicity of U-87 MG cells is reduced by miR-96 silencing. miR-96 contributes to the activation of Wnt/β-catenin pathway in glioma cells. HMG-box transcription factor 1 (HBP-1), a Wnt/β-catenin pathway inhibitor, is suppressed by miR-96. The reactivation of Wnt/β-catenin signaling causes an increase in the proliferation of glioma cells, and a decrease in miR-96 expression. On the other hand, HBP1 silencing promotes miR-96 expression. Collectively, miR-96 contributes to the progression of glioma by enhancing the activation of the Wnt/β-catenin pathway, and the miR-96/HBP1/Wnt/β-catenin regulatory circuitry promotes the proliferation of glioma cells.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/26164003", "title": "Pokemon and MEF2D co-operationally promote invasion of hepatocellular carcinoma", "abstract": "Hepatocellular carcinoma (HCC) is one of the most deadly human malignancy, and frequent invasion and metastasis is closely associated with its poor prognosis. However, the molecular mechanism underlying HCC invasion is still not completely elucidated. Pokemon is a well-established oncogene for HCC growth, but its contribution to HCC invasion has not been studied yet. In this paper, Pokemon was found to be overexpressed in MHCC-97H HCC cell line, which possesses higher invasiveness. Downregulation of Pokemon abolished the invasion of MHCC-97H HCC cell lines. Pokemon overexpression was able to enhance the invasion of MHCC-97L cells with lower invasiveness. MEF2D, an oncogene promoting the invasion of HCC cells, was further detected to be upregulated and downregulated when Pokemon was overexpressed and silenced, respectively. Online database analysis indicated that one Pokemon recognition site was located within the promoter of MEF2D. Chromatin co-precipitation, luciferase, and qPCR assays all proved that Pokemon can promote the expression of MEF2D in HCC cells. Restoration of MEF2D expression can prevent the impaired invasion of HCC cells with Pokemon silencing, while suppression of MEF2D abolished the effect of Pokemon overexpression on HCC invasion. More interestingly, MEF2D was also found to increase the transcription of Pokemon by binding myocyte enhancer factor 2 (MEF2) sites within its promoter region, implying an auto-regulatory circuit consisting of these two oncogenes that can promote HCC invasion. Our findings can contribute to the understanding of molecular mechanism underlying HCC invasion, and provided evidence that targeting this molecular loop may be a promising strategy for anti-invasion therapy.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/26355845", "title": "Retracted: miR-1244/Myocyte Enhancer Factor 2D Regulatory Loop Contributes to the Growth of Lung Carcinoma", "abstract": "Lung carcinoma greatly threatens human health, due to its increasing incidence in recent years and poor prognosis. However, this malignancy displays resistance against current therapeutic strategies. One of major causes leading to bad outcomes for lung cancer therapy is the lack of understanding on its tumorigenesis and progression. To explore the molecular mechanism by which lung cancer progresses, we employed multidisciplinary approaches and used lung cancer cell lines as research models. miR-1244 was underexpressed in lung carcinoma by 40.6-73.8%, which is highly associated with patients' survival. miR-1244 restoration was shown to affect the proliferation, survival, and invasion of lung cancer cells. miR-1244 suppression rendered normal lung fibroblasts with malignant phenotypes. miR-1244 overexpression can reduce the growth of lung cancer xenografts. miR-1244 was then verified to negatively regulate the expression of myocyte enhancer factor 2D (MEF2D) in lung cancer cells. MEF2D can also affect the expression of miR-1244 by directly binding to its promoter. Further study showed that MEF2D is required for the effect of miR-1244 on lung cancer and normal cells. These results suggested that there is an autoregulatory circuit consisting of miR-1244 and MEF2D, which contributes to the progression of lung cancer. Targeting this molecular loop may be a promising strategy for lung carcinoma treatment.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/26780942", "title": "MicroRNA-155 enhances the activation of Wnt/β-catenin signaling in colorectal carcinoma by suppressing HMG-box transcription factor 1", "abstract": "Colorectal carcinoma (CRC) is a malignant solid tumor arising from the large intestine and is associated with an increasing incidence and poor prognosis. Further understanding of the molecular mechanisms underlying CRC may contribute to the development of novel effective therapeutic strategies. MicroRNAs (miRs), including miR‑155, have been reported to be associated with the etiology and biology of CRC; however, the molecular mechanisms by which miR‑155 affect CRC remain to be fully elucidated. The present study used a multidisciplinary approach, involving reverse transcription‑quantitative polymerase chain reaction, northern blotting, MTT assay, cell cycle progression analysis, immunoblotting, and animal experiments, to determine the possible targets of miR‑155 in CRC cells. miR‑155 was found to be overexpressed in CRC tissue samples, compared with paired normal colon tissue samples. In addition, the inhibition of miR‑155 induced a deceleration in CRC cell proliferation and inactivation of the Wnt/β‑catenin signaling pathway. miR‑155 suppression also reduced the growth of CRC xenografts in an animal model. HMG‑box transcription factor 1 (HBP1) was identified as a novel target of miR‑155, which mediated its effect on CRC via the Wnt/β‑catenin pathway. Furthermore, patients with CRC exhibiting higher serum levels of miR‑155 exhibited reduced survival rates. In conclusion, the present study demonstrated that miR‑155 may contribute to the progression and growth of CRC by enhancing the Wnt/β‑catenin pathway in an HBP1‑associated mechanism. Therefore, miR‑155 may be considered a promising therapeutic target for the treatment of CRC.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/31933743", "title": "miR-195 inhibits esophageal cancer cell proliferation and promotes apoptosis by downregulating YAP1.", "abstract": "Yes-associated protein 1 (YAP1) regulates a variety of genes related to cell proliferation, cycle and apoptosis, and plays a role in the pathogenesis of esophageal cancer. It was found that the expression of miR-195 was significantly decreased in esophageal cancer tissues, suggesting its anti-cancer effect. Bioinformatics analysis revealed the targeted relationship between miR-195 and the 3'-UTR of YAP1. This study investigated the role of miR-195 in regulating YAP1 expression and affecting proliferation and apoptosis of esophageal cancer cells.The tumor tissue and the adjacent tissue of patients with esophageal cancer were collected to detect the expressions of miR-195 and YAP1. Dual luciferase reporter gene assay was adopted to validate the targeted regulation between miR-195 and YAP1. Esophageal cancer EC9706 cells and normal esophageal epithelial HEEC cells were cultured in vitro to measure the expression of miR-195 and YAP1. EC9706 cells were divided into miR-NC group and miR-195 mimic group followed by analysis of cell apoptosis by flow cytometry and cell proliferation by EdU staining.Compared with adjacent tissues, miR-195 was significantly decreased, while YAP1 mRNA and protein were significantly upregulated in esophageal cancer tissues. Dual luciferase reporter gene assay confirmed that there was a targeted relationship between miR-195 and YAP1. Compared with HEEC cells, miR-195 expression was declined, whereas YAP1 was elevated in EC9706 cells. Transfection of miR-195 mimic significantly downregulated YAP1 expression, resulting in increased apoptosis and decreased proliferation of EC9706 cells.Decreased expression of miR-195 plays a regulatory role in increasing YAP1 expression and promoting the pathogenesis of esophageal cancer. Elevation of miR-195 inhibites the expression of YAP1, restrains cell proliferation, and promotes cell apoptosis.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/31933860", "title": "Expression of miR-141 and YAP1 in gastric carcinoma and modulation of cancer cell proliferation and apoptosis.", "abstract": "Yes-associated protein 1 (YAP1) plays important roles in facilitating cell proliferation and decreasing apoptosis and is related to gastric cancer. Abnormal down-regulation of miR-141 is associated with gastric cancer pathogenesis, suggesting a potentially tumor suppressor role. Bioinformatics analysis found complementary binding sites between miR-141 and YP1. This study investigated the role of miR-141 in mediating YAP1 expression and biological behavior of gastric cancer cells. Gastric cancer tissues were collected using normal mucosal tissues as the control. qRT-PCR compared expression of miR-141 and YAP1 mRNA, and western blot quantified YAP1 protein expression. Spearman approach analyzed the correlation between miR-141 and YAP1 mRNA in cancer tissues. Dual luciferase reporter gene assay confirmed the targeted regulation between miR-141 and YAP1. Using GES-1 cell as the control, miR-141 and YAP1 expression were measured in gastric cancer cell lines SGC7901 and MGC03. Those cells were transfected with miR-141 mimic in the presence or absence of miR-YAP1 mimic followed by flow cytometry for apoptosis and EdU staining for proliferation. Cancer tissues had decreased miR-141 and higher YAP1 expression, which was associated with TNM stage. YAP1 mRNA and miR-141 were positively correlated (r=-0.623, P<0.001). Dual luciferase assay demonstrated targeted regulation between miR-141 and YAP1. Comparing to GES-1 cells, SGC7901 and MGC803 cells had decreased miR-141 and increased YAP1 expression. Transfection of miR-141 mimic inhibited YAP1 expression or cell proliferation and facilitated apoptosis. However, overexpression of YAP1 decreased the effect of miR-141 mimic on cell proliferation and apoptosis. miR-141 down-regulation and YAP1 up-regulation are correlated with gastric cancer pathogenesis. miR-141 targets and inhibits YAP1 expression, to suppress gastric cancer cell proliferation and induce apoptosis.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/31933892", "title": "Expression of miR-195 and MEK1 in patients with bladder cancer and their relationship to prognosis.", "abstract": "MAPK kinase 1 (MEK1) plays an important role in regulating cell proliferation and apoptosis through activation of the ERK/MAPK signaling pathway. It was found that the expression of miR-195 in bladder cancer was abnormally decreased, suggesting that miR-195 may affect the development of bladder cancer. In this study, we examined the expression of miR-195 and MEK1 in bladder cancer tissues and analyzed the relationship between miR-195 and MEK1 in cell proliferation and apoptosis in bladder cancer cells.The expression of MEK1 in bladder cancer tissues was detected by western blot, and the expression levels of miR-195 and MEK1 mRNA were detected by qRT-PCR. Log Rank test was used to compare the survival and prognosis of patients with low and high expression of miR-195 and MEK1 by using the median expression of miR-195 and MEK1. Bioinformatics analysis and double luciferase reporter gene test were used to verify the relationship between miR-195 and MEK1. Bladder cancer BIU-87 and 5637 cells were cultured in vitro and divided into two groups: miR-NC group and miR-195 mimic group. The expression of MEK1 and p-MEK1 protein was detected by western blot, apoptosis was detected by flow cytometry, and cell proliferation was detected by EdU staining.Compared with normal bladder tissue, expression of miR-195 in bladder cancer tissue was significantly decreased, while the expression of MEK1 mRNA and protein was significantly increased. The prognosis of patients with low expression of miR-195 was worse than those with high expression of miR-195. The prognosis of patients with low expression of MEK1 was better than those with high expression of MEK1. Bioinformatics analysis showed that there was a target complementary binding site between miR-195 and MEK1. Double luciferase reporter gene experiments confirmed that there was a target regulatory relationship between miR-195 and MEK1. miR-195 mimic transfection could significantly down-regulate the expression of MEK1 and p-MEK1 proteins in BIU-87 and 5637 cells, weaken cell proliferation, and increase cell apoptosis.Overexpression of miR-195 can inhibit the proliferation of bladder cancer cells by inhibiting MEK1, which provides further evidence for developing therapy against bladder cancer.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/31696474", "title": "LncRNA CASC11 promotes the development of esophageal carcinoma by regulating KLF6.", "abstract": "The aim of this study was to investigate the expression level of long non-coding RNA (lncRNA) CASC11 in esophageal carcinoma (ECa), and to further explore its relationship with clinical progression, pathological parameters, and prognosis of ECa patients.Quantitative Real Time-Polymerase Chain Reaction (qRT-PCR) was used to examine the level of lncRNA CASC11 in 45 pairs of ECa tissues and adjacent normal tissues. The relationship between the lncRNA CASC11 level and clinical progression, pathological parameters, and prognosis of ECa patients was analyzed. Meanwhile, the level of lncRNA CASC11 in the ECa cell lines was verified by qPCR as well. In addition, lncRNA CASC11 knockdown model was constructed using lentiviral transfection in ECa cell lines. Subsequently, the cell counting kit-8 (CCK8), colony formation assay, and flow cytometry were used to explore the effect of lncRNA CASC11 on the biological functions of the ECa cells. Finally, the Western Blot and the recovery experiments were used to explore the potential mechanism.In this work, the qPCR results showed that the expression level of lncRNA CASC11 in the ECa tissues was remarkably higher than that of the adjacent normal tissues, and the difference was statistically significant (p<0.05). Compared with patients with a low level of lncRNA CASC11, the pathological stage of patients with high expression was significantly higher, while the overall survival rate was lower (p<0.05). Compared with negative control (NC) group, the proliferation ability of the cells in the lncRNA CASC11 knockdown group CASC11 significantly decreased, whereas cell apoptosis remarkably increased (p<0.05). The Western Blot results revealed that protein expression of KLF6 was remarkably up-regulated after lncRNA CASC11 knockdown. In addition, the recovery experiments found that lncRNA CASC11 and KLF6 had mutual regulation, thereby promoting the malignant progression of ECa.LncRNA CASC11 expression was remarkably up-regulated in ECa, which was associated with the pathological stage and poor prognosis of ECa. In addition, lncRNA CASC11 could promote the malignant progression of ECa by mutual regulation of KLF6.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/32141543", "title": "Circ_0001982 accelerates the progression of colorectal cancer via sponging microRNA-144.", "abstract": "The aim of this study was to uncover the expression pattern and biological function of circ_0001982 in the progression of colorectal cancer (CRC).Relative expression level of circ_0001982 in 66 paired CRC tissues and adjacent normal tissues was detected by quantitative Real Time-Polymerase Chain Reaction (qRT-PCR). The association between circ_0001982 level and clinical indexes of CRC patients was assessed. The effect of circ_0001982 on cellular behaviors of HT29 and HCT-116 cells was evaluated in vitro. Dual-Luciferase reporter gene assay was conducted to verify the binding relation between circ_0001982 and microRNA-144. Finally, rescue experiments were performed to assess the role of the circ_0001982/microRNA-144 axis in mediating the progression of CRC.Circ_0001982 was significantly up-regulated in CRC tissues when compared with adjacent normal ones. CRC patients with a high expression level of circ_0001982 showed a significantly higher rate of distant metastasis and worse survival. Knockdown of circ_0001982 remarkably attenuated the proliferative, migratory, and invasive capacities of HCT-116 cells. However, opposite results were observed after the overexpression of circ_0001982 in HT29 cells. MicroRNA-144 was verified as a target gene of circ_0001982, which could be negatively regulated by circ_0001982. Furthermore, microRNA-144 was capable of reversing the regulatory effect of circ_0001982 on the proliferative, migratory, and invasive capacities of CRC cells.Up-regulated circ_0001982 was closely related to distant metastasis and poor prognosis of CRC. In addition, circ_0001982 attenuated the progression of CRC by negatively regulating microRNA-144.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/32373970", "title": "METTL3 promotes the progression of nasopharyngeal carcinoma through mediating M6A modification of EZH2.", "abstract": "The aim of this study was to investigate whether METTL3 promoted the progression of nasopharyngeal carcinoma (NPC) by silencing CDKN1C through EZH2.Quantitative Real Time-Polymerase Chain Reaction (qRT-PCR) was performed to examine the expression level of METTL3 in 48 pairs of NPC tissues and adjacent normal tissues. METTL3 expression in patients with different tumor lymph node metastasis (TNM) stages was detected by qRT-PCR as well. The Kaplan-Meier method was used to analyze the interplay between METTL3 expression and the prognosis of patients with NPC. At the same time, METTL3 expression in normal epithelial cell line (BEAS-2B) and NPC cell lines (SUNE-1 and C666-1) was examined using qRT-PCR. After METTL3 was knocked down in SUNE-1 cells, cell viability and migration abilities were analyzed by cell counting kit-8 (CCK-8) test and wound healing assay, respectively. The mRNA and protein expressions of EZH2 were detected by qRT-PCR and Western blot, respectively. RNA immunoprecipitation (RIP) assay was applied to detect the binding of METTL3 to EZH2 mRNA and the m6A modification on EZH2 mRNA. After knockdown of EZH2 in SUNE-1 cells, qRT-PCR was used to detect the mRNA expression of CDKN1C. Meanwhile, chromatin immunoprecipitation (ChIP) assay was conducted to analyze the binding of EZH2 to the CDKN1C promoter region. After down-regulation of METTL3 in SUNE-1 cells, the protein expressions of EZH2 and CDKN1C were detected using Western blot. After simultaneous knockdown of METTL3 and CDKN1C in SUNE-1 cells, CCK8 assay and wound healing assay were applied to examine cell viability and migration abilities.METTL3 expression in NPC tissues was remarkably higher than that of adjacent normal tissues. Meanwhile, METTL3 expression in T3 and T4 tumors was significantly higher than that of T1 and T2 tumors. In patients with lymph node metastasis, the expression of METTL3 was remarkably higher than those without metastasis. Survival analysis demonstrated that patients with higher expression of METTL3 exhibited significantly longer overall survival time than those with lower METTL3 expression. QRT-PCR revealed that METTL3 was highly expressed in NPC cell lines, including SUNE-1 and C666-1. After knock-down of METTL3 in SUNE-1 cells, cell viability and migration abilities were both markedly weakened. Meanwhile, the protein expression of EZH2 was remarkably reduced. However, no significant changes were observed in EZH2 mRNA level. RIP assay revealed that METTL3 could bind to EZH2 mRNA, and a m6A modification was verified on EZH2 mRNA. After knockdown of EZH2, the mRNA level of CDKN1C in SUNE-1 cells was significantly up-regulated. CHIP assay indicated that EZH2 could bind to CDKN1C. Western blot showed that, after interfering with METTL3 in SUNE-1 cells, the protein expression of EZH2 decreased significantly, while CDKN1C was up-regulated. In addition, simultaneous downregulation of METTL3 and CDKN1C in SUNE-1 cells reversed the influence of METTL3 on cell viability and migration abilities.METTL3 was highly expressed in NPC tissues, which might inhibit EZH2 expression by mediating M6A modification of EZH2 mRNA. Furthermore, CDKN1C could increase the malignancy of NPC cells and promote the progression of NPC.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/32636651", "title": "&lt;p&gt;circPDSS1 Stimulates the Development of Colorectal Cancer via Activating the Wnt/β-Catenin Signaling&lt;/p&gt;", "abstract": "This study aims to illustrate the role of circPDSS1 and the Wnt/β-catenin signaling in the development of colorectal cancer (CRC).Cancerous mucosa and normal paracancerous mucosa tissues more than 5 cm away from the tumor were surgically collected from 56 CRC patients. circPDSS1 levels in collected tissues and CRC cell lines were detected by quantitative real-time polymerase chain reaction (qRT-PCR). The influence of circPDSS1 on clinical features of CRC patients was analyzed. After knockdown of circPDSS1 in HCT-8 and HCT-116 cells, phenotype changes were examined by Transwell, tube formation and wound healing assay. Western blot and rescue experiments were finally performed to uncover the role of circPDSS1 and the Wnt/β-catenin signaling in the development of CRC.circPDSS1 was upregulated in CRC mucosa tissues than controls. High level of circPDSS1 predicted high rates of lymphatic metastasis and distant metastasis, and poor prognosis in CRC patients. Knockdown of circPDSS1 attenuated migratory ability and angiogenesis in CRC cells. Protein levels of key genes in the Wnt/β-catenin signaling, including β-catenin, GSK-3β, c-Myc, MMP-9 and cyclin D1 were downregulated in CRC cells transfected with sh-circPDSS1. Overexpression of β-catenin reversed the role of circPDSS1 in attenuating migratory ability and angiogenesis in CRC cells.Upregulated circPDSS1 in CRC is closely linked to lymphatic metastasis, distant metastasis and overall survival. It stimulates the migratory ability and angiogenesis in CRC cells via activating the Wnt/β-catenin signaling.         "}, {"id": "https://pubmed.ncbi.nlm.nih.gov/33155193", "title": "Circ_0005276 aggravates the development of epithelial ovarian cancer by targeting ADAM9.", "abstract": "Our purpose was to assess the relationship between circ_0005276 and clinical features of epithelial ovarian cancer (EOC), and to illustrate the regulatory effect of circ_0005276 on migratory potential in EOC cells.EOC tissues and adjacent normal ones were collected from 49 EOC patients. Relative levels of circ_0005276 and ADAM9 in EOC tissues were determined by quantitative Real Time-Polymerase Chain Reaction (qRT-PCR). The relationship between circ_0005276 and clinical features of EOC patients was analyzed. Moreover, migratory potentials of CAOV3 and SKOV3 cells affected by circ_0005276 were examined by transwell and wound healing assay. Regulatory effects of circ_0005276/ADAM9 feedback loop on the development of EOC were finally detected by Luciferase assay and rescue experiments.It was found that circ_0005276 was upregulated in EOC tissues and its level was positively linked to rates of lymphatic metastasis and distant metastasis in EOC patients. Survival analysis showed worse OS and DFS in EOC patients expressing a high level of circ_0005276 than those with a low level. Besides, knockdown of circ_0005276 attenuated migratory potentials in EOC cells. ADAM9 was verified to be the target gene binding circ_0005276, and its level was positively regulated by circ_0005276. Notably, circ_0005276 aggravated the development of EOC by targeting ADAM9.Circ_0005276 is highly expressed in EOC tissues, and its level is positively linked to metastasis. Serving as an unfavorable gene in the prognosis of EOC, circ_0005276 aggravates the development of EOC by upregulating ADAM9.         "}]